SELECT * FROM "ИсторияЗапросов"

SELECT * FROM "Поставка"

SELECT * FROM "Поставщик"

INSERT INTO "Поставка" ("КодПоставщика", "ДатаПоставки") VALUES (1, '2024-10-21 19:00:00');

INSERT INTO "Поставка" ("КодПоставщика", "ДатаПоставки") VALUES (2, '2024-09-20 18:00:00');

INSERT INTO "Поставка" ("КодПоставщика", "ДатаПоставки") VALUES (3, '2024-08-19 17:00:00');

INSERT INTO "Поставка" ("КодПоставщика", "ДатаПоставки") VALUES (4, '2024-07-18 16:00:00');

INSERT INTO "Поставка" ("КодПоставщика", "ДатаПоставки") VALUES (5, '2024-06-17 15:00:00');

INSERT INTO "Поставка" ("КодПоставщика", "ДатаПоставки") VALUES (6, '2024-05-16 14:00:00');

INSERT INTO "Поставка" ("КодПоставщика", "ДатаПоставки") VALUES (7, '2024-04-15 13:00:00');

SELECT * FROM "ИсторияЗапросов"

INSERT INTO "Поставка" ("КодПоставщика", "ДатаПоставки") VALUES (8, '2024-03-14 12:00:00');

INSERT INTO "ИсторияЗапросов" ("ТекстЗапроса") VALUES ('INSERT INTO "Поставщик" ("НазваниеПоставщика", "ПредставительПоставщика", "Обращаться", "КонтактныйТелефон", "Адрес") VALUES ("ООО "Альянс", "Алексеев Р. И.", "с 10 до 18", "+7-495-334-13-01", "ул. Расковой, д. 21");');

INSERT INTO "ИсторияЗапросов" ("ТекстЗапроса") VALUES ('''INSERT INTO "Поставщик" ("НазваниеПоставщика", "ПредставительПоставщика", "Обращаться", "КонтактныйТелефон", "Адрес") VALUES ('ООО "Альянс"', 'Алексеев Р. И.', 'с 10 до 18', '+7-495-334-13-01', 'ул. Расковой, д. 21');''')

INSERT INTO "ИсторияЗапросов" ("ТекстЗапроса") VALUES ('INSERT INTO "Поставщик" ("НазваниеПоставщика", "ПредставительПоставщика", "Обращаться", "КонтактныйТелефон", "Адрес") VALUES ('ООО "Альянс"', 'Алексеев Р. И.', 'с 10 до 18', '+7-495-334-13-01', 'ул. Расковой, д. 21');')

CREATE TRIGGER триггер_логирования AFTER INSERT OR UPDATE OR DELETE ON "ИсторияЗапросов" FOR EACH ROW EXECUTE FUNCTION логировать_запрос();

CREATE TRIGGER триггер_логирования AFTER INSERT OR UPDATE OR DELETE OR SELECT OR CREATE ON "ИсторияЗапросов" FOR EACH ROW EXECUTE FUNCTION логировать_запрос();

CREATE TRIGGER триггер_логирования AFTER INSERT OR UPDATE ON "ИсторияЗапросов" FOR EACH ROW EXECUTE FUNCTION логировать_запрос();

CREATE OR REPLACE FUNCTION логировать_запрос() RETURNS TRIGGER AS $$ BEGIN INSERT INTO "ИсторияЗапросов" ("ТекстЗапроса") VALUES (current_query()); RETURN NEW; END; $$ LANGUAGE plpgsql;

CREATE OR REPLACE FUNCTION логировать_запрос() RETURNS TRIGGER AS $$ BEGIN INSERT INTO "ИсторияЗапросов" ("ТекстЗапроса") VALUES (current_query());

BEGIN FOR obj IN SELECT * FROM pg_event_trigger_ddl_commands() LOOP IF obj.command_tag IN ('SELECT', 'INSERT', 'UPDATE', 'DELETE') THEN INSERT INTO query_history (query_text) VALUES (obj.object_identity);

CREATE OR REPLACE FUNCTION log_query() RETURNS event_trigger AS $$ DECLARE obj RECORD;

CREATE OR REPLACE FUNCTION log_query() RETURNS event_trigger AS $$ DECLARE obj RECORD;

CREATE OR REPLACE FUNCTION log_query() RETURNS event_trigger AS $$ DECLARE obj RECORD;

BEGIN FOR obj IN SELECT * FROM pg_event_trigger_ddl_commands() LOOP IF obj.command_tag IN ('SELECT', 'INSERT', 'DELETE', 'UPDATE') THEN INSERT INTO "История запросов" ("КодЗапроса") VALUES (obj.object_identity);

CREATE TABLE "История запросов" ( "КодЗапроса" SERIAL PRIMARY KEY, "ТекстЗапроса" TEXT NOT NULL, "ВремяЗапроса" TIMESTAMP DEFAULT CURRENT_TIMESTAMP );

CREATE TABLE "История запросов" ( "КодЗапроса" SERIAL PRIMARY KEY "ТекстЗапроса" TEXT NOT NULL "ВремяЗапроса" TIMESTAMP DEFAULT CURRENT_TIMESTAMP );

INSERT INTO "Поставка" ("КодПоставщика", "ДатаПоставки") VALUES (9, '2024-02-13 11:00:00');

SELECT * FROM "Поставка"

SELECT * FROM 'Поставка'

INSERT INTO "Поставка" ("КодПоставщика", "ДатаПоставки") VALUES (10, '2024-01-12 10:00:00');

INSERT INTO "Поставка" ("КодПоставщика", "ДатаПоставки") VALUES (10, '2024-01-12 10-00-00');

SELECT * FROM "Поставщик"

INSERT INTO "Поставщик" ("НазваниеПоставщика", "ПредставительПоставщика", "Обращаться", "КонтактныйТелефон", "Адрес") VALUES ('ООО "Фортуна"', 'Егоров И. К.', 'с 11 до 17', '+7-495-940-24-42', 'ул. Новослободская, д. 30');

INSERT INTO "Поставщик" ("НазваниеПоставщика", "ПредставительПоставщика", "Обращаться", "КонтактныйТелефон", "Адрес") VALUES ('ООО "Виктория"', 'Орлова В. И.', 'с 10 до 17', '+7-495-783-25-66', 'ул. Беговая, д. 29');

INSERT INTO "Поставщик" ("НазваниеПоставщика", "ПредставительПоставщика", "Обращаться", "КонтактныйТелефон", "Адрес") VALUES ('ООО "Авангард"', 'Макаров Л. Т.', 'с 9 до 17', '+7-499-903-33-01', 'ул. Фадеева, д. 28');

INSERT INTO "Поставщик" ("НазваниеПоставщика", "ПредставительПоставщика", "Обращаться", "КонтактныйТелефон", "Адрес") VALUES ('ООО "Прогресс"', 'Шевченко Р. О.', 'с 10 до 17', '+7-498-989-40-10', 'ул. Ходынская, д. 27');

INSERT INTO "Поставщик" ("НазваниеПоставщика", "ПредставительПоставщика", "Обращаться", "КонтактныйТелефон", "Адрес") VALUES ('ООО "Спектр"', 'Семенов В. В.', 'с 10-30 до 17-30', '+7-495-476-73-36', 'ул. Красина, д. 26');

INSERT INTO "Поставщик" ("НазваниеПоставщика", "ПредставительПоставщика", "Обращаться", "КонтактныйТелефон", "Адрес") VALUES ('ООО "Лидер"', 'Павлов А. Ю.', 'с 12 до 15', '+7-498-669-25-49', 'ул. Грузинский пер., д. 25');

INSERT INTO "Поставщик" ("НазваниеПоставщика", "ПредставительПоставщика", "Обращаться", "КонтактныйТелефон", "Адрес") VALUES ('ООО "Орион"', 'Александрова А. П.', 'с 8 до 16', '+7-499-934-04-21', 'ул. Пресненский Вал, д. 24');

INSERT INTO "Поставщик" ("НазваниеПоставщика", "ПредставительПоставщика", "Обращаться", "КонтактныйТелефон", "Адрес") VALUES ('ООО "Феникс"', 'Федоров О. Ф.', 'с 9 до 16', '+7-495-035-73-67', 'ул. Лесная, д. 23');

INSERT INTO "Поставщик" ("НазваниеПоставщика", "ПредставительПоставщика", "Обращаться", "КонтактныйТелефон", "Адрес") VALUES ('ООО "Вектор"', 'Михайлов П. В.', 'с 11 до 17', '+7-495-934-11-42', 'ул. Правды, д. 22');

INSERT INTO "Поставщик" ("НазваниеПоставщика", "ПредставительПоставщика", "Обращаться", "КонтактныйТелефон", "Адрес") VALUES ('ООО "Альянс"', 'Алексеев Р. И.', 'с 10 до 18', '+7-495-334-13-01', 'ул. Расковой, д. 21');

CREATE INDEX goods ON "Товары" ("НаименованиеТовара", "ТехническиеХарактеристики", "Описание");

CREATE INDEX employee ON "Сотрудники" ("Фамилия", "Имя", "Должность");

CREATE INDEX supplier ON "Поставщик" ("НазваниеПоставщика", "ПредставительПоставщика", "Обращаться");

CREATE INDEX supply ON "Поставка" ("КодПоставки", "КодПоставщика", "ДатаПоставки");

CREATE INDEX orders ON "Заказы" ("КодТовара", "ДатаРазмещения", "ДатаИсполнения");

CREATE INDEX clients ON "Клиенты" ("ФИО", "Адрес", "Телефон")

SELECT DISTINCT "ДатаПоставки" FROM "Поставка";

SELECT DISTINCT "КодПоставщика" FROM "Поставка";

SELECT DISTINCT "Кол-во" FROM "Товары";

SELECT DISTINCT "КодПоставки" FROM "Товары";

SELECT DISTINCT "КодТовара" FROM "Заказы";

SELECT DISTINCT "КодСотрудника" FROM "Заказы";

SELECT DISTINCT "Адрес" FROM "Поставщик";

SELECT DISTINCT "Обращаться" FROM "Поставщик";

SELECT DISTINCT "Должность" FROM "Сотрудники";

SELECT DISTINCT "Должность", "Адрес" FROM "Сотрудники";

SELECT DISTINCT "Имя", "Отчество" FROM "Сотрудники";

SELECT DISTINCT "КодКлиента", "ФИО" FROM "Клиенты";

SELECT DISTINCT "Телефон", "Адрес" FROM "Клиенты";

SELECT "ДатаПоставки" FROM "Поставка" GROUP BY "ДатаПоставки";

SELECT "КодПоставщика" FROM "Поставка" GROUP BY "КодПоставщика";

SELECT "Наличие" FROM "Товары" GROUP BY "Наличие";

SELECT "КодПоставки" FROM "Товары" GROUP BY "КодПоставки";

SELECT "КодСотрудника" FROM "Заказы" GROUP BY "КодСотрудника";

SELECT "КодТовара" FROM "Заказы" GROUP BY "КодТовара";

SELECT "Обращаться" FROM "Поставщик" GROUP BY "Обращаться";

SELECT "НазваниеПоставщика" FROM "Поставщик" GROUP BY "НазваниеПоставщика";

SELECT "Должность" FROM "Сотрудники" GROUP BY "Должность";

SELECT "Имя" FROM "Сотрудники" GROUP BY "Имя";

SELECT "Адрес" FROM "Клиенты" GROUP BY "Адрес";

SELECT "ФИО", "Адрес" FROM "Клиенты" GROUP BY "Адрес";

SELECT "ФИО" FROM "Клиенты" GROUP BY "ФИО";

SELECT * FROM "Клиенты" GROUP BY "ФИО";

SELECT "КодПоставки", "ДатаПоставки", "НазваниеПоставщика", "КонтактныйТелефон" FROM "Поставка" INNER JOIN "Поставщик" ON "Поставка"."КодПоставщика" = "Поставщик"."КодПоставщика" ORDER BY "Поставщик"."КодПоставщика" ASC;

SELECT "КодПоставки", "ДатаПоставки", "НазваниеПоставщика", "КонтактныйТелефон" FROM "Поставка" INNER JOIN "Поставщик" ON "Поставка"."КодПоставщика" = "Поставщик"."КодПоставщика" ORDER BY "ДатаПоставки" DESC;

SELECT * FROM "Товары" ORDER BY "СтоимостьЗакупки" DESC;

SELECT * FROM "Товары" ORDER BY "НаименованиеТовара";

SELECT "Товары"."НаименованиеТовара", "ДатаРазмещения", "ДатаИсполнения" FROM "Заказы" INNER JOIN "Товары" ON "Заказы"."КодТовара" = "Товары"."КодТовара" ORDER BY "Товары"."КодТовара";

SELECT "Товары"."НаименованиеТовара", "ДатаРазмещения", "ДатаИсполнения" FROM "Заказы" INNER JOIN "Товары" ON "Заказы"."КодТовара" = "Товары"."КодТовара" ORDER BY "КодТовара";

SELECT "Товары"."НаименованиеТовара", "ДатаРазмещения", "ДатаИсполнения" FROM "Заказы" INNER JOIN "Товары" ON "Заказы"."КодТовара" = "Товары"."КодТовара" ORDER BY "КодЗаказа" DESC;

SELECT "Товары"."НаименованиеТовара", "ДатаРазмещения", "ДатаИсполнения" FROM "Заказы" ORDER BY "КодЗаказа" DESC INNER JOIN "Товары" ON "Заказы"."КодТовара" = "Товары"."КодТовара";

SELECT "Товары"."НаименованиеТовара", "ДатаРазмещения", "ДатаИсполнения" FROM "Заказы" ORDER BY "КодЗаказа" DESC;

SELECT * FROM "Поставщик" ORDER BY "Адрес" ASC;

SELECT * FROM "Поставщик" ORDER BY "НазваниеПоставщика" DESC;

SELECT * FROM "Сотрудники" ORDER BY "Имя" DESC;

SELECT * FROM "Сотрудники" ORDER BY "Имя";

SELECT * FROM "Клиенты" ORDER BY "ФИО";

SELECT * FROM "Клиенты" ORDER BY "КодКлиента" DESC;

SELECT "КодПоставки", "ДатаПоставки", "НазваниеПоставщика", "КонтактныйТелефон" FROM "Поставка" INNER JOIN "Поставщик" ON "Поставка"."КодПоставщика" = "Поставщик"."КодПоставщика" WHERE "ДатаПоставки" > '2024-04-15';

SELECT "НаименованиеТовара", "ТехническиеХарактеристики", "Наличие", "Кол-во" FROM "Товары" WHERE "Кол-во" < 10;

SELECT "НаименованиеТовара", "ТехническиеХарактеристики", "Описание", "Кол-во" FROM "Товары" WHERE "Кол-во" > 5;

SELECT "НаименованиеТовара", "ТехническиеХарактеристики", "Описание", "Кол-во" FROM "Товары" WHERE "Кол-во" > 2;

SELECT "Товары"."НаименованиеТовара", "ДатаРазмещения", "ДатаИсполнения", "Товары"."Наличие" FROM "Заказы" INNER JOIN "Товары" ON "Заказы"."КодТовара" = "Товары"."КодТовара" WHERE "Товары"."Наличие" != FALSE;

SELECT "Товары"."НаименованиеТовара", "ДатаРазмещения", "ДатаИсполнения" FROM "Заказы" INNER JOIN "Товары" ON "Заказы"."КодТовара" = "Товары"."КодТовара" WHERE "Товары"."Кол-во" > 5;

SELECT "Товары"."НаименованиеТовара", "ДатаРазмещения", "ДатаИсполнения" FROM "Заказы" WHERE "Товары"."Кол-во" > 5 INNER JOIN "Товары" ON "Заказы"."КодТовара" = "Товары"."КодТовара";

INNER JOIN "Товары" ON "Заказы"."КодТовара" = "Товары"."КодТовара" WHERE "Товары"."Кол-во" > 5;

SELECT "Товары"."НаименованиеТовара", "ДатаРазмещения", "ДатаИсполнения" FROM "Заказы" WHERE "Товары"."Кол-во" > 5 INNER JOIN "Товары" ON "Заказы"."КодТовара" = "Товары"."КодТовара";

SELECT "НазваниеПоставщика", "ПредставительПоставщика", "Обращаться", "КонтактныйТелефон" FROM "Поставщик" WHERE "Обращаться" LIKE '%до 17';

SELECT "НазваниеПоставщика", "Адрес" FROM "Поставщик" WHERE "Адрес" LIKE 'ул. П%';

SELECT "Название", "Адрес" FROM "Поставщик" WHERE "Адрес" LIKE 'ул. П%';

SELECT "Фамилия", "Имя", "Адрес" FROM "Сотрудники" WHERE "Адрес" LIKE '%, д. 1%';

SELECT "Фамилия", "Имя", "Должность" FROM "Сотрудники" WHERE "ДатаРождения" >= '1977-08-03';

SELECT "Фамилия", "Имя", "Должность" FROM "Сотрудники" WHERE "ДатаРождения" >= 1977-08-03;

SELECT "ФИО", "Адрес" FROM "Клиенты" WHERE "КодКлиента" >= 3;

SELECT "КодКлиента" FROM "Клиенты" WHERE "КодКлиента" <= 8;

SELECT "КодКиента" FROM "Клиенты" WHERE "КодКиента" <= 8;

UPDATE "Поставка" SET "ДатаПоставки" = '2024-04-15 13:00:55' WHERE "ДатаПоставки" = '2024-04-15 13:00:00';

UPDATE "Поставка" SET "ДатаПоставки" = '2024-03-14 12:00:55' WHERE "ДатаПоставки" = '2024-03-14 12:00:00';

UPDATE "Поставка" SET "ДатаПоставки" = '2024-02-13 11:00:55' WHERE "ДатаПоставки" = '2024-02-13 11:00:00';

UPDATE "Поставка" SET "ДатаПоставки" = '2024-01-12 10:00:55' WHERE "ДатаПоставки" = '2024-01-12 10:00:00';

UPDATE "Товары" SET "СтоимостьЗакупки" = 505 WHERE "СтоимостьЗакупки" = 500;

UPDATE "Товары" SET "СтоимостьПродажи" = 620 WHERE "СтоимостьПродажи" = 610;

UPDATE "Товары" SET "СтоимостьПродажи" = 620 WHERE "СтоиСтоимостьПродажимостьЗакупки" = 610;

UPDATE "Товары" SET "СтоимостьЗакупки" = 500 WHERE "СтоимостьЗакупки" = 505;

UPDATE "Товары" SET "Описание" = 'ОпИсаниеТовара2' WHERE "Описание" = 'ОписаниеТовара2';

UPDATE "Товары" SET "ТехническиеХарактеристики" = 'ХарактеристикиТовара1' WHERE "ТехническиеХарактеристики" = 'Хар-киТовара1';

UPDATE "Заказы" SET "ДатаИсполнения" = '2024-11-05 13:00:30' WHERE "ДатаИсполнения" = '2024-11-05 13:00:00';

UPDATE "Заказы" SET "ДатаИсполнения" = '2024-11-04 14:00:30' WHERE "ДатаИсполнения" = '2024-11-04 14:00:00';

UPDATE "Заказы" SET "ДатаРазмещения" = '2024-11-02 11:00:30' WHERE "ДатаРазмещения" = '2024-11-02 11:00:00';

UPDATE "Заказы" SET "ДатаРазмещения" = '2024-11-01 10:00:30' WHERE "ДатаРазмещения" = '2024-11-01 10:00:00';

UPDATE "Поставщик" SET "Адрес" = 'ул. Пресненский Вал, д. 24в' WHERE "Адрес" = 'ул. Пресненский Вал, д. 24';

UPDATE "Поставщик" SET "КонтактныйТелефон" = '+7-495-035-73-55' WHERE "КонтактныйТелефон" = '+7-495-035-73-55';

UPDATE "Поставщик" SET "Обращаться" = 'с 11:30 до 17' WHERE "Обращаться" = 'с 11 до 17';

UPDATE "Поставщик" SET "НазваниеПоставщика" = 'ООО "Альянс и Ко"' WHERE "НазваниеПоставщика" = 'ООО "Альянс"';

UPDATE "Сотрудники" SET "ДатаРождения" = '1977-04-21' WHERE "ДатаРождения" = '1977-04-04';

UPDATE "Сотрудники" SET "ДатаРождения" = '1977-04-21 WHERE "ДатаРождения" = '1977-04-04';

UPDATE "Сотрудники" SET "ДомашнийТелефон" = '+7-916-403-53-89' WHERE "ДомашнийТелефон" = '+7-916-403-53-93';

UPDATE "Сотрудники" SET "Адрес" = 'ул. Перерва, д. 2/1, кв. 2' WHERE "Адрес" = 'ул. Перерва, д. 2, кв. 2';

UPDATE "Сотрудники" SET "Должность" = 'генеральный директор' WHERE "Должность" = 'директор';

UPDATE "Клиенты" SET "Адрес" = 'ул. Делегатская, д. 20, к. 1, кв. 20' WHERE "Адрес" = 'ул. Делегатская, д. 20, кв. 20';

UPDATE "Клиенты" SET "ФИО" = 'Сергеев В. В.' WHERE "ФИО" = 'Сергеев В. С.';

UPDATE "Клиенты" SET "Телефон" = '+7-905-235-32-55' WHERE "Телефон" = '+7-905-235-32-57';

UPDATE "Клиенты" SET "Телефон" = '+7-905-235-32-55' WHERE "Адрес" = '+7-905-235-32-57';

UPDATE "Клиенты" SET "Адрес" = 'ул. Советской Армии, д. 11а, кв. 11' WHERE "Адрес" = 'ул. Советской Армии, д. 11, кв. 11';

UPDATE "Клиенты" SET "Адрес" = "ул. Советской Армии, д. 11а, кв. 11" WHERE "Адрес" = 'ул. Советской Армии, д. 11, кв. 11';

UPDATE "Клиенты" SET "Адрес" = "ул. Советской Армии, д. 11а, кв. 11" WHERE "Адрес" = "ул. Советской Армии, д. 11, кв. 11";

UPDATE "Клиенты" SET "Адрес" = "ул. Советской Армии, д. 11а, кв. 11" WHERE "Адрес" = "ул. Советской Армии, д. 11, кв. 11";

UPDATE "Клиенты" SET "Адрес" = ""ул. Советской Армии, д. 11а, кв. 11"" WHERE "Адрес" = ""ул. Советской Армии, д. 11, кв. 11"";

SELECT "ДатаПоставки", "НазваниеПоставщика", "НаименованиеТовара", "СтоимостьЗакупки", "ДатаРазмещения", "ДатаИсполнения" FROM "Поставка" RIGHT JOIN "Товары" ON "Поставка"."КодПоставки" = "Товары"."КодПоставки" FULL OUTER JOIN "Поставщик" ON "Поставка"."КодПоставщика" = "Поставщик"."КодПоставщика" LEFT JOIN "Заказы" ON "Товары"."КодТовара" = "Заказы"."КодТовара";

SELECT "ДатаПоставки", "НазваниеПоставщика", "НаименованиеТовара", "СтоимостьЗакупки", "ДатаРазмещения", "ДатаИсполнения" FROM "Поставка" FULL OUTER JOIN "Товары" ON "Поставка"."КодПоставки" = "Товары"."КодПоставки" LEFT JOIN "Поставщик" ON "Поставка"."КодПоставщика" = "Поставщик"."КодПоставщика" RIGHT JOIN "Заказы" ON "Товары"."КодТовара" = "Заказы"."КодТовара";

SELECT "ДатаПоставки", "НазваниеПоставщика", "НаименованиеТовара", "СтоимостьЗакупки", "ДатаРазмещения", "ДатаИсполнения" FROM "Поставка" LEFT JOIN "Товары" ON "Поставка"."КодПоставки" = "Товары"."КодПоставки" RIGHT JOIN "Поставщик" ON "Поставка"."КодПоставщика" = "Поставщик"."КодПоставщика" FULL OUTER JOIN "Заказы" ON "Товары"."КодТовара" = "Заказы"."КодТовара";

SELECT "ДатаПоставки", "НазваниеПоставщика", "НаименованиеТовара", "СтоимостьЗакупки", "ФИО", "Телефон" FROM "Поставка" LEFT JOIN "Товары" ON "Поставка"."КодПоставки" = "Товары"."КодПоставки" RIGHT JOIN "Поставщик" ON "Поставка"."КодПоставщика" = "Поставщик"."КодПоставщика" FULL OUTER JOIN "Заказы" ON "Товары"."КодТовара" = "Заказы"."КодТовара";

SELECT "ДатаПоставки", "НазваниеПоставщика", "НаименованиеТовара", "СтоимостьЗакупки", "ФИО", "Телефон" FROM "Поставка" LEFT JOIN "Товары" ON "Поставка"."КодПоставки" = "Товары"."КодПоставки" RIGHT JOIN "Поставщик" ON "Поставка"."КодПоставщика" = "Поставщик"."КодПоставщика" FROM "Заказы" FULL OUTER JOIN "Клиенты" ON "Клиенты"."КодКлиента" = "Заказы"."КодКлиента" FULL OUTER JOIN "Товары" ON "Товары"."КодТовара" = "Заказы"."КодТовара";

SELECT "ДатаПоставки", "НазваниеПоставщика", "НаименованиеТовара", "СтоимостьЗакупки", "ФИО", "Телефон" FROM "Поставка" LEFT JOIN "Товары" ON "Поставка"."КодПоставки" = "Товары"."КодПоставки" RIGHT JOIN "Поставщик" ON "Поставка"."КодПоставщика" = "Поставщик"."КодПоставщика" FULL OUTER JOIN "Клиенты" ON "Клиенты"."КодКлиента" = "Заказы"."КодКлиента" FULL OUTER JOIN "Товары" ON "Товары"."КодТовара" = "Заказы"."КодТовара";

SELECT "ДатаПоставки", "НазваниеПоставщика", "НаименованиеТовара", "СтоимостьЗакупки", "ФИО", "Телефон" FROM "Поставка" LEFT JOIN "Товары" ON "Поставка"."КодПоставки" = "Товары"."КодПоставки" RIGHT JOIN "Поставщик" ON "Товары"."КодПоставщика" = "Поставщик"."КодПоставщика" FULL OUTER JOIN "Клиенты" ON "Клиенты"."КодКлиента" = "Заказы"."КодКлиента" FULL OUTER JOIN "Товары" ON "Товары"."КодТовара" = "Заказы"."КодТовара";

FULL OUTER JOIN "Товары" ON "Товары"."КодТовара" = "Заказы"."КодТовара";

SELECT "НаименованиеТовара", "СтоимостьЗакупки", "СтоимостьПродажи", "Поставка"."ДатаПоставки", "Поставщик"."НазваниеПоставщика", "Заказы"."ДатаИсполнения" FROM "Товары" LEFT JOIN "Поставка" ON "Товары"."КодПоставки" = "Поставка"."КодПоставки" RIGHT JOIN "Поставщик" ON "Поставка"."КодПоставщика" = "Поставщик"."КодПоставщика" FULL OUTER JOIN "Заказы" ON "Товары"."КодТовара" = "Заказы"."КодТовара";

SELECT "НаименованиеТовара", "СтоимостьЗакупки", "СтоимостьПродажи", "Поставка"."ДатаПоставки", "Поставщик"."НазваниеПоставщика", "Заказы"."ДатаИсполнения" FROM "Товары" FULL OUTER JOIN "Поставка" ON "Товары"."КодПоставки" = "Поставка"."КодПоставки" LEFT JOIN "Поставщик" ON "Поставка"."КодПоставщика" = "Поставщик"."КодПоставщика" RIGHT JOIN "Заказы" ON "Товары"."КодТовара" = "Заказы"."КодТовара";

SELECT "НаименованиеТовара", "СтоимостьЗакупки", "СтоимостьПродажи", "Поставка"."ДатаПоставки", "Поставщик"."НазваниеПоставщика", "Заказы"."ДатаИсполнения" FROM "Товары" RIGHT JOIN "Поставка" ON "Товары"."КодПоставки" = "Поставка"."КодПоставки" FULL OUTER JOIN "Поставщик" ON "Поставка"."КодПоставщика" = "Поставщик"."КодПоставщика" LEFT JOIN "Заказы" ON "Товары"."КодТовара" = "Заказы"."КодТовара";

SELECT "КодЗаказа", "Товары"."НаименованиеТовара", "ФИО", "Сотрудники"."Фамилия", "Сотрудники"."Должность" FROM "Заказы" RIGHT JOIN "Клиенты" ON "Заказы"."КодКлиента" = "Клиенты"."КодКлиента" FULL OUTER JOIN "Товары" ON "Заказы"."КодТовара" = "Товары"."КодТовара" LEFT JOIN "Сотрудники" ON "Заказы"."КодСотрудника" = "Сотрудники"."КодСотрудника";

SELECT "КодЗаказа", "Товары"."НаименованиеТовара", "ФИО", "Сотрудники"."Фамилия", "Сотрудники"."Должность" FROM "Заказы" FULL OUTER JOIN "Клиенты" ON "Заказы"."КодКлиента" = "Клиенты"."КодКлиента" LEFT JOIN "Товары" ON "Заказы"."КодТовара" = "Товары"."КодТовара" RIGHT JOIN "Сотрудники" ON "Заказы"."КодСотрудника" = "Сотрудники"."КодСотрудника";

SELECT "КодЗаказа", "Товары"."НаименованиеТовара", "ФИО", "Сотрудники"."Фамилия", "Сотрудники"."Должность" FROM "Заказы" LEFT JOIN "Клиенты" ON "Заказы"."КодКлиента" = "Клиенты"."КодКлиента" RIGHT JOIN "Товары" ON "Заказы"."КодТовара" = "Товары"."КодТовара" FULL OUTER JOIN "Сотрудники" ON "Заказы"."КодСотрудника" = "Сотрудники"."КодСотрудника";

SELECT "КодЗаказа", "Товары"."НаименованиеТовара", "ФИО", "Сотрудники"."Фамилия", "Сотрудники"."Должность" FROM "Заказы" INNER JOIN "Клиенты" ON "Заказы"."КодКлиента" = "Клиенты"."КодКлиента" INNER JOIN "Товары" ON "Заказы"."КодТовара" = "Товары"."КодТовара" INNER JOIN "Сотрудники" ON "Заказы"."КодСотрудника" = "Сотрудники"."КодСотрудника";

INNER JOIN "Сотрудники" ON "Заказы"."КодСотрудника" = "Сотрудники"."КодСотрудника";

SELECT "КодЗаказа", "Товары"."НаименованиеТовара", "ФИО", "СтоимостьЗакупки", "СтоимостьПродажи" FROM "Заказы" FULL OUTER JOIN "Клиенты" ON "Заказы"."КодКлиента" = "Клиенты"."КодКлиента" FULL OUTER JOIN "Товары" ON "Заказы"."КодТовара" = "Товары"."КодТовара";

SELECT "КодЗаказа", "Товары"."НаименованиеТовара", "ФИО", "СтоимостьЗакупки", "СтоимостьПродажи" FROM "Заказы" RIGHT JOIN "Клиенты" ON "Заказы"."КодКлиента" = "Клиенты"."КодКлиента" LEFT JOIN "Товары" ON "Заказы"."КодТовара" = "Товары"."КодТовара";

SELECT "КодЗаказа", "Товары"."НаименованиеТовара", "ФИО", "СтоимостьЗакупки", "СтоимостьПродажи" FROM "Заказы" LEFT JOIN "Клиенты" ON "Заказы"."КодКлиента" = "Клиенты"."КодКлиента" RIGHT JOIN "Товары" ON "Заказы"."КодТовара" = "Товары"."КодТовара";

SELECT "КодЗаказа", "Товары"."НаименованиеТовара", "ФИО", "СтоимостьЗакупки", "СтоимостьПродажи" FROM "Заказы" INNER JOIN "Клиенты" ON "Заказы"."КодКлиента" = "Клиенты"."КодКлиента" INNER JOIN "Товары" ON "Заказы"."КодТовара" = "Товары"."КодТовара";

SELECT "КодЗаказа", "Товары"."НаименованиеТовара", "ФИО", "СтоимостьЗакупки", "СтоимостьПродажи" FROM "Заказы" INNER JOIN "Клиенты", "Товары" ON "Заказы"."КодКлиента" = "Клиенты"."КодКлиента", "Заказы"."КодТовара" = "Товары"."КодТовара";

SELECT "КодЗаказа", "Товары"."НаименованиеТовара", "ФИО", "СтоимостьЗакупки", "СтоимостьПродажи" FROM "Заказы" INNER JOIN "Клиенты" ON "Заказы"."КодКлиента" = "Клиенты"."КодКлиента", "Заказы"."КодТовара" = "Товары"."КодТовара";

SELECT "КодЗаказа", "Товары"."НаименованиеТовара", "ФИО", "СтоимостьЗакупки", "СтоимостьПродажи" FROM "Заказы" INNER JOIN "Клиенты" ON "Заказы"."КодКлиента" = "Клиенты"."КодКлиента";

SELECT "НазваниеПоставщика", "ПредставительПоставщика", "Обращаться", "КонтактныйТелефон", "КодПоставки", "ДатаПоставки" FROM "Поставщик" FULL OUTER JOIN "Поставка" ON "Поставщик"."КодПоставщика" = "Поставка"."КодПоставщика";

SELECT "НазваниеПоставщика", "ПредставительПоставщика", "Обращаться", "КонтактныйТелефон", "КодПоставки", "ДатаПоставки" FROM "Поставщик" RIGHT JOIN "Поставка" ON "Поставщик"."КодПоставщика" = "Поставка"."КодПоставщика";

SELECT "НазваниеПоставщика", "ПредставительПоставщика", "Обращаться", "КонтактныйТелефон", "КодПоставки", "ДатаПоставки" FROM "Поставщик" LEFT JOIN "Поставка" ON "Поставщик"."КодПоставщика" = "Поставка"."КодПоставщика";

SELECT "НазваниеПоставщика", "ПредставительПоставщика", "Обращаться", "КонтактныйТелефон", "КодПоставки", "ДатаПоставки" FROM "Поставщик" INNER JOIN "Поставка" ON "Поставщик"."КодПоставщика" = "Поставка"."КодПоставщика";

SELECT "НазваниеПоставщика", "КодПоставки" FROM "Поставщик" FULL OUTER JOIN "Поставка" ON "Поставщик"."КодПоставщика" = "Поставка"."КодПоставщика";

SELECT "НазваниеПоставщика", "КодПоставки" FROM "Поставщик" RIGHT JOIN "Поставка" ON "Поставщик"."КодПоставщика" = "Поставка"."КодПоставщика";

SELECT "НазваниеПоставщика", "КодПоставки" FROM "Поставщик" LEFT JOIN "Поставка" ON "Поставщик"."КодПоставщика" = "Поставка"."КодПоставщика";

SELECT "НазваниеПоставщика", "КодПоставки" FROM "Поставщик" INNER JOIN "Поставка" ON "Поставщик"."КодПоставщика" = "Поставка"."КодПоставщика";

SELECT "Сотрудники"."КодСотрудника", "Фамилия", "Имя", "КодЗаказа", "КодТовара", "КодКлиента" FROM "Сотрудники" FULL OUTER JOIN "Заказы" ON "Сотрудники"."КодСотрудника" = "Заказы"."КодСотрудника";

SELECT "Сотрудники"."КодСотрудника", "Фамилия", "Имя", "КодЗаказа", "КодТовара", "КодКлиента" FROM "Сотрудники" RIGHT JOIN "Заказы" ON "Сотрудники"."КодСотрудника" = "Заказы"."КодСотрудника";

SELECT "Сотрудники"."КодСотрудника", "Фамилия", "Имя", "КодЗаказа", "КодТовара", "КодКлиента" FROM "Сотрудники" LEFT JOIN "Заказы" ON "Сотрудники"."КодСотрудника" = "Заказы"."КодСотрудника";

SELECT "Сотрудники"."КодСотрудника", "Фамилия", "Имя", "КодЗаказа", "КодТовара", "КодКлиента" FROM "Сотрудники" INNER JOIN "Заказы" ON "Сотрудники"."КодСотрудника" = "Заказы"."КодСотрудника";

SELECT "КодСотрудника", "Фамилия", "Имя", "КодЗаказа", "КодТовара", "КодКлиента" FROM "Сотрудники" INNER JOIN "Заказы" ON "Сотрудники"."КодСотрудника" = "Заказы"."КодСотрудника";

SELECT "Фамилия", "Имя", "Должность", "КодТовара", "ДатаРазмещения", "ДатаИсполнения" FROM "Сотрудники" FULL OUTER JOIN "Заказы" ON "Сотрудники"."КодСотрудника" = "Заказы"."КодСотрудника";

SELECT "Фамилия", "Имя", "Должность", "КодТовара", "ДатаРазмещения", "ДатаИсполнения" FROM "Сотрудники" RIGHT JOIN "Заказы" ON "Сотрудники"."КодСотрудника" = "Заказы"."КодСотрудника";

SELECT "Фамилия", "Имя", "Должность", "КодТовара", "ДатаРазмещения", "ДатаИсполнения" FROM "Сотрудники" LEFT JOIN "Заказы" ON "Сотрудники"."КодСотрудника" = "Заказы"."КодСотрудника";

SELECT "Фамилия", "Имя", "Должность", "КодТовара", "ДатаРазмещения", "ДатаИсполнения" FROM "Сотрудники" INNER JOIN "Заказы" ON "Сотрудники"."КодСотрудника" = "Заказы"."КодСотрудника";

SELECT "Фамилия", "Имя", "Должность", "КодТовара", "ДатаРазмещения", "ДатаИсполнения" FROM "Сотрудники" INNER JOIN "Сотрудники" ON "Сотрудники"."КодСотрудника" = "Сотрудники"."КодСотрудника";

SELECT "КодТовара", "ФИО" FROM "Заказы" RIGHT JOIN "Клиенты" ON "Заказы"."КодКлиента" = "Клиенты"."КодКлиента";

SELECT "ФИО", "КодТовара" FROM "Заказы" RIGHT JOIN "Клиенты" ON "Заказы"."КодКлиента" = "Клиенты"."КодКлиента";

SELECT "ФИО", "КодТовара" FROM "Заказы" RIGHT JOIN "Клиенты" ON "Клиенты"."КодКлиента" = "Заказы"."КодКлиента";

SELECT "ФИО", "КодТовара" FROM "Клиенты" RIGHT JOIN "Заказы" ON "Клиенты"."КодКлиента" = "Заказы"."КодКлиента";

SELECT "ФИО", "КодТовара" FROM "Клиенты" LEFT JOIN "Заказы" ON "Клиенты"."КодКлиента" = "Заказы"."КодКлиента";

SELECT * FROM "Клиенты"

SELECT * FROM "Заказы"

SELECT "ФИО", "КодТовара" FROM "Клиенты" INNER JOIN "Заказы" ON "Клиенты"."КодКлиента" = "Заказы"."КодКлиента";

SELECT "КодПоставщика", "ДатаПоставки" FROM "Поставка"

SELECT "НаименованиеТовара", "ТехническиеХарактеристики", "Описание" FROM "Товары"

SELECT "НаименованиеТовара", "СтоимостьЗакупки", "СтоимостьПродажи" FROM "Товары"

SELECT "КодЗаказа", "КодТовара" FROM "Заказы"

SELECT "ДатаРазмещения", "ДатаИсполнения", "КодСотрудника" FROM "Заказы"

SELECT "НазваниеПоставщика", "ПредставительПоставщика", "Обращаться", "КонтактныйТелефон" FROM "Поставщик"

SELECT "НазваниеПоставщика", "ПредставительПоставщика", "Обращаться" FROM "Поставщик"

SELECT "НазваниеПоставщика", "КонтактныйТелефон", "Адрес" FROM "Поставщик"

SELECT "Название", "КонтактныйТелефон", "Адрес" FROM "Поставщик"

SELECT "Фамилия", "ДатаРождения" FROM "Сотрудники"

SELECT "Имя", "Отчество", "Фамилия", "Должность" FROM "Сотрудники"

SELECT "КодКлиента", "Телефон", "Адрес" FROM "Клиенты"

SELECT "ФИО", "Адрес", "Телефон" FROM "Клиенты"

SELECT * FROM "Заказы"

INSERT INTO "Заказы" ("КодСотрудника", "КодТовара", "ДатаРазмещения", "ДатаИсполнения", "КодКлиента") VALUES (1, 10, '2024-11-10 19:00:00', '2024-11-11 19:00:00', 2);

INSERT INTO "Заказы" ("КодСотрудника", "КодТовара", "ДатаРазмещения", "ДатаИсполнения", "КодКлиента") VALUES (1, 6, '2024-11-09 18:00:00', '2024-11-10 18:00:00', 9);

INSERT INTO "Заказы" ("КодСотрудника", "КодТовара", "ДатаРазмещения", "ДатаИсполнения", "КодКлиента") VALUES (2, 4, '2024-11-08 17:00:00', '2024-11-09 17:00:00', 4);

INSERT INTO "Заказы" ("КодСотрудника", "КодТовара", "ДатаРазмещения", "ДатаИсполнения", "КодКлиента") VALUES (2, 2, '2024-11-07 16:00:00', '2024-11-08 16:00:00', 6);

INSERT INTO "Заказы" ("КодСотрудника", "КодТовара", "ДатаРазмещения", "ДатаИсполнения", "КодКлиента") VALUES (3, 10, '2024-11-06 15:00:00', '2024-11-07 15:00:00', 7);

INSERT INTO "Заказы" ("КодСотрудника", "КодТовара", "ДатаРазмещения", "ДатаИсполнения", "КодКлиента") VALUES (3, 7, '2024-11-05 14:00:00', '2024-11-06 14:00:00', 8);

INSERT INTO "Заказы" ("КодСотрудника", "КодТовара", "ДатаРазмещения", "ДатаИсполнения", "КодКлиента") VALUES (4, 1, '2024-11-04 13:00:00', '2024-11-05 13:00:00', 1);

SELECT * FROM "Заказы"

INSERT INTO "Заказы" ("КодСотрудника", "КодТовара", "ДатаРазмещения", "ДатаИсполнения", "КодКлиента") VALUES (4, 8, '2024-11-03 12:00:00', '2024-11-04 14:00:00', 3);

INSERT INTO "Заказы" ("КодСотрудника", "КодТовара", "ДатаРазмещения", "ДатаИсполнения", "КодКлиента") VALUES (10, 5, '2024-11-02 11:00:00', '2024-11-03 11:00:00', 2);

INSERT INTO "Заказы" ("КодСотрудника", "КодТовара", "ДатаРазмещения", "ДатаИсполнения", "КодКлиента") VALUES (10, 3, '2024-11-01 10:00:00', '2024-11-02 10:00:00', 1);

INSERT INTO "Заказы" ("КодСотрудника", "КодТовара", "ДатаРазмещения", "ДатаИсполнения", "КодКлиента") VALUES (10, 'Товар3', '2024-11-01 10:00:00', '2024-11-02 10:00:00', 1);

SELECT * FROM "Сотрудники"

SELECT * FROM "Клиенты"

SELECT * FROM "Сотрудники"

SELECT * FROM "Товары"

INSERT INTO "Товары" ("КодПоставки", "НаименованиеТовара", "ТехническиеХарактеристики", "Описание", "Изображение", "СтоимостьЗакупки", "Наличие", "Кол-во", "СтоимостьПродажи") VALUES (7, 'Товар10', 'Хар-киТовара10', 'ОписаниеТовара10', E'\x28\x29\x30', 1200, TRUE, 12, 1210);

INSERT INTO "Товары" ("КодПоставки", "НаименованиеТовара", "ТехническиеХарактеристики", "Описание", "Изображение", "СтоимостьЗакупки", "Наличие", "Кол-во", "СтоимостьПродажи") VALUES (8, 'Товар9', 'Хар-киТовара9', 'ОписаниеТовара9', E'\x25\x26\x27', 1100, TRUE, 11, 1110);

INSERT INTO "Товары" ("КодПоставки", "НаименованиеТовара", "ТехническиеХарактеристики", "Описание", "Изображение", "СтоимостьЗакупки", "Наличие", "Кол-во", "СтоимостьПродажи") VALUES (5, 'Товар8', 'Хар-киТовара8', 'ОписаниеТовара8', E'\x22\x23\x24', 1000, TRUE, 10, 1010);

INSERT INTO "Товары" ("КодПоставки", "НаименованиеТовара", "ТехническиеХарактеристики", "Описание", "Изображение", "СтоимостьЗакупки", "Наличие", "Кол-во", "СтоимостьПродажи") VALUES (5, 'Товар7', 'Хар-киТовара7', 'ОписаниеТовара7', E'\x19\x20\x21', 900, TRUE, 9, 910);

INSERT INTO "Товары" ("КодПоставки", "НаименованиеТовара", "ТехническиеХарактеристики", "Описание", "Изображение", "СтоимостьЗакупки", "Наличие", "Кол-во", "СтоимостьПродажи") VALUES (3, 'Товар6', 'Хар-киТовара6', 'ОписаниеТовара6', E'\x16\x17\x18', 800, TRUE, 8, 810);

INSERT INTO "Товары" ("КодПоставки", "НаименованиеТовара", "ТехническиеХарактеристики", "Описание", "Изображение", "СтоимостьЗакупки", "Наличие", "Кол-во", "СтоимостьПродажи") VALUES (3, 'Товар5', 'Хар-киТовара5', 'ОписаниеТовара5', E'\x13\x14\x15', 700, TRUE, 7, 710);

INSERT INTO "Товары" ("КодПоставки", "НаименованиеТовара", "ТехническиеХарактеристики", "Описание", "Изображение", "СтоимостьЗакупки", "Наличие", "Кол-во", "СтоимостьПродажи") VALUES (3, 'Товар4', 'Хар-киТовара4', 'ОписаниеТовара4', E'\x10\x11\x12', 600, TRUE, 6, 610);

INSERT INTO "Товары" ("КодПоставки", "НаименованиеТовара", "ТехническиеХарактеристики", "Описание", "Изображение", "СтоимостьЗакупки", "Наличие", "Кол-во", "СтоимостьПродажи") VALUES (1, 'Товар3', 'Хар-киТовара3', 'ОписаниеТовара3', E'\x7\x8\x9', 500, TRUE, 5, 510);

INSERT INTO "Товары" ("КодПоставки", "НаименованиеТовара", "ТехническиеХарактеристики", "Описание", "Изображение", "СтоимостьЗакупки", "Наличие", "Кол-во", "СтоимостьПродажи") VALUES (1, 'Товар2', 'Хар-киТовара2', 'ОписаниеТовара2', E'\x4\x5\x6', 400, TRUE, 4, 410);

INSERT INTO "Товары" ("КодПоставки", "НаименованиеТовара", "ТехническиеХарактеристики", "Описание", "Изображение", "СтоимостьЗакупки", "Наличие", "Кол-во", "СтоимостьПродажи") VALUES (1, 'Товар1', 'Хар-киТовара1', 'ОписаниеТовара1', E'\x1\x2\x3', 300, TRUE, 3, 310);

SELECT * FROM "Поставка"

SELECT * FROM "ИсторияЗапросов"

SELECT * FROM "Поставка"

SELECT * FROM "Поставщик"

INSERT INTO "Поставка" ("КодПоставщика", "ДатаПоставки") VALUES (1, '2024-10-21 19:00:00');

INSERT INTO "Поставка" ("КодПоставщика", "ДатаПоставки") VALUES (2, '2024-09-20 18:00:00');

INSERT INTO "Поставка" ("КодПоставщика", "ДатаПоставки") VALUES (3, '2024-08-19 17:00:00');

INSERT INTO "Поставка" ("КодПоставщика", "ДатаПоставки") VALUES (3, 
'2024-08-19 17:00:00');
CREATE INDEX

UPDATE "Товары" SET "Кол-во" = '21' WHERE "Описание" = 'ОписаниеТовара7';

UPDATE "Товары" SET "Кол-во" = "21" WHERE "Описание" = 'ОписаниеТовара7';

UPDATE "Товары" SET "Кол-во" = "21" WHERE "Описание" = "ОписаниеТовара7";

CREATE TRIGGER total_cost BEFORE UPDATE OF "Кол-во" ON "Товары" FOR EACH ROW WHEN (NEW."Кол-во" IS DISTINCT FROM OLD."Кол-во") EXECUTE FUNCTION update_total_cost();

CREATE TRIGGER total_cost BEFORE INSERT OR UPDATE OF "Кол-во" ON "Товары" FOR EACH ROW WHEN (OLD."Кол-во" IS DISTINCT FROM NEW."Кол-во") EXECUTE FUNCTION update_total_cost();

CREATE OR REPLACE FUNCTION update_total_cost() RETURNS TRIGGER AS $total_cost$ BEGIN NEW."Общая сумма стоимости товара" := NEW."Кол-во" * NEW."СтоимостьПродажи"; RETURN NEW; END; $total_cost$ LANGUAGE plpgsql;

CREATE OR REPLACE FUNCTION update_total_cost() RETURNS TRIGGER AS $$ BEGIN NEW."Общая сумма стоимости товара" := NEW."Кол-во" * NEW."СтоимостьПродажи";

CREATE OR REPLACE FUNCTION update_total_cost RETURNS TRIGGER AS $$ BEGIN NEW."Общая сумма стоимости товара" := NEW."Кол-во" * NEW."СтоимостьПродажи"; RETURN NEW; END; $$ LANGUAGE plpgsql;

ALTER TABLE "Товары" ADD COLUMN "Общая сумма стоимости товара" INTEGER

TRUNCATE "ИсторияЗапросов";

DELETE FROM "Товары" WHERE "НаименованиеТовара" = 'Какое-то наименование';

INSERT INTO "Товары" ("НаименованиеТовара") VALUES ('Какое-то наименование');

INSERT INTO "ИсторияЗапросов" ("ТекстЗапроса") VALUES ('Текст');

INSERT INTO "ИсторияЗапросов" ("ТекстЗапроса") VALUES ('Текст');

INSERT INTO "ИсторияЗапросов" ("ТекстЗапроса") VALUES ("Текст");

SELECT COUNT("СтоимостьЗакупки") FROM "Товары";

SELECT MIN("СтоимостьЗакупки") FROM "Товары";

SELECT MAX("СтоимостьЗакупки") FROM "Товары";

SELECT COUNT("СтоимостьПродажи") FROM "Товары";

SELECT MIN("СтоимостьПродажи") FROM "Товары";

SELECT MAX("СтоимостьПродажи") FROM "Товары";

SELECT MAX("Наличие") FROM "Товары";

SELECT MIN("Наличие") FROM "Товары";

SELECT MIN("Наличие") FROM "Товары";

SELECT COUNT("Наличие") FROM "Товары";

SELECT COUNT("Кол-во") FROM "Товары";

SELECT MIN("Кол-во") FROM "Товары";

SELECT MAX("Кол-во") FROM "Товары";

SELECT MAX("КодПоставщика") FROM "Поставщик";

SELECT MIN("КодПоставщика") FROM "Поставщик";

SELECT COUNT("КодПоставщика") FROM "Поставщик";

SELECT COUNT("КодПоставщика") FROM "Поставщик";

SELECT MIN("КодПоставщика") FROM "Поставщик";

SELECT MAX("КодПоставщика") FROM "Поставщик";

SELECT MAX("КодПоставки") FROM "Поставка";

SELECT MIN("КодПоставки") FROM "Поставка";

SELECT COUNT("КодПоставки") FROM "Поставка";

SELECT MAX("КодСотрудника") FROM "Сотрудники";

SELECT MIN("КодСотрудника") FROM "Сотрудники";

SELECT COUNT("КодСотрудника") FROM "Сотрудники";

SELECT COUNT("КодЗаказа") FROM "Заказы";

SELECT MIN("КодЗаказа") FROM "Заказы";

SELECT MAX("КодЗаказа") FROM "Заказы";

SELECT COUNT("СтоимостьПродажи" - "СтоимостьЗакупки") FROM "Товары";

SELECT MIN("СтоимостьПродажи" - "СтоимостьЗакупки") FROM "Товары";

SELECT MAX("СтоимостьПродажи" - "СтоимостьЗакупки") FROM "Товары";

SELECT MAX("СтоимостьПродажи" - "СтоимостьЗакупки") FROM "Товары";

SELECT COUNT("СтоимостьЗакупки" - "СтоимостьПродажи") FROM "Товары";

SELECT MIN("СтоимостьЗакупки" - "СтоимостьПродажи") FROM "Товары";

SELECT MAX("СтоимостьЗакупки" - "СтоимостьПродажи") FROM "Товары";

SELECT AVG("СтоимостьЗакупки" - "СтоимостьПродажи") FROM "Товары";

SELECT AVG("СтоимостьПродажи" - "СтоимостьЗакупки") FROM "Товары";

SELECT AVG("СтоимостьПродажи" - "СтоимостьЗакупки") FROM "Товары";

SELECT AVG("КодЗаказа") FROM "Заказы";

SELECT AVG("КодСотрудника") FROM "Сотрудники";

SELECT AVG("КодПоставки") FROM "Поставка";

SELECT AVG("КодПоставщика") FROM "Поставщик";

SELECT AVG("Кол-во") FROM "Товары";

SELECT AVG("Наличие") FROM "Товары";

SELECT AVG("СтоимостьПродажи") FROM "Товары";

SELECT AVG("СтоимостьЗакупки") FROM "Товары";

SELECT SUM("СтоимостьЗакупки" - "СтоимостьПродажи") FROM "Товары";

SELECT SUM("СтоимостьПродажи" - "СтоимостьЗакупки") FROM "Товары";

SELECT SUM("КодЗаказа") FROM "Заказы";

SELECT SUM("КодСотрудника") FROM "Сотрудники";

SELECT SUM("КодПоставки") FROM "Поставка";

SELECT SUM("КодПоставщика") FROM "Поставщик";

SELECT SUM("Кол-во") FROM "Товары";

SELECT SUM("Наличие") FROM "Товары";

SELECT SUM("СтоимостьПродажи") FROM "Товары";

SELECT SUM("СтоимостьЗакупки") FROM "Товары";

SELECT * FROM clients_view;

CREATE VIEW clients_view AS SELECT CONCAT(LEFT("ФИО", 2), '***', RIGHT("ФИО", 1)) AS "ФИО", CONCAT(LEFT("Адрес", 5), '***', RIGHT("Адрес", 1)) AS "Адрес", CONCAT(LEFT("Телефон", 5), '***', RIGHT("Телефон", 1)) AS "Телефон" FROM "Клиенты";

CREATE VIEW clients AS SELECT CONCAT(LEFT("ФИО", 2), '***', RIGHT("ФИО", 1)) AS "ФИО", CONCAT(LEFT("Адрес", 5), '***', RIGHT("Адрес", 1)) AS "Адрес", CONCAT(LEFT("Телефон", 5), '***', RIGHT("Телефон", 1)) AS "Телефон" FROM "Клиенты";

CREATE VIEW clients AS SELECT CONCAT(SUBSTRING("ФИО", 1, 2, 3), '***', SUBSTRING("ФИО", -1)) AS "ФИО", CONCAT(SUBSTRING("Адрес", 1, 2, 3, 4, 5), '***', SUBSTRING("Адрес", -1)) AS "Адрес", CONCAT(SUBSTRING("Телефон", 1, 2, 3, 4, 5), '***', SUBSTRING("Телефон", -1)) AS "Телефон" FROM "Клиенты";

CREATE VIEW clients AS SELECT CONCAT(SUBSTRING("ФИО", 1, 2, 3), '***', SUBSTR("ФИО", -1)) AS "ФИО", CONCAT(SUBSTRING("Адрес", 1, 2, 3, 4, 5), '***', SUBSTR("Адрес", -1)) AS "Адрес", CONCAT(SUBSTRING("Телефон", 1, 2, 3, 4, 5), '***', SUBSTR("Телефон", -1)) AS "Телефон" FROM "Клиенты";

CREATE VIEW clients AS SELECT CONCAT(SUBSTR("ФИО", 1, 2, 3), '***', SUBSTR("ФИО", -1)) AS "ФИО", CONCAT(SUBSTR("Адрес", 1, 2, 3, 4, 5), '***', SUBSTR("Адрес", -1)) AS "Адрес", CONCAT(SUBSTR("Телефон", 1, 2, 3, 4, 5), '***', SUBSTR("Телефон", -1)) AS "Телефон" FROM "Клиенты";

CREATE VIEW clients AS SELECT CONCAT(SUBSTR("ФИО", 1, 2, 3), '***', SUBSTR("ФИО", -1) AS "ФИО_скр", CONCAT(SUBSTR("Адрес", 1, 2, 3, 4, 5), '***', SUBSTR("Адрес", -1) AS "Адрес", CONCAT(SUBSTR("Телефон", 1, 2, 3, 4, 5), '***', SUBSTR("Телефон", -1) AS "Телефон" FROM "Клиенты";

CREATE VIEW clients AS SELECT CONCAT(SUBSTR("ФИО", 1, 2, 3), '***', SUBSTR("ФИО", -1) AS "ФИО", CONCAT(SUBSTR("Адрес", 1, 2, 3, 4, 5), '***', SUBSTR("Адрес", -1) AS "Адрес", CONCAT(SUBSTR("Телефон", 1, 2, 3, 4, 5), '***', SUBSTR("Телефон", -1) AS "Телефон" FROM "Клиенты";

CREATE INDEX goods ON "Товары" ("НаименованиеТовара", "ТехническиеХарактеристики", "Описание");

CREATE INDEX employee ON "Сотрудники" ("Фамилия", "Имя", "Должность");

CREATE INDEX supplier ON "Поставщик" ("НазваниеПоставщика", "ПредставительПоставщика", "Обращаться");

CREATE INDEX supply ON "Поставка" ("КодПоставки", "КодПоставщика", "ДатаПоставки");

CREATE INDEX orders ON "Заказы" ("КодТовара", "ДатаРазмещения", "ДатаИсполнения");

CREATE INDEX clients ON "Клиенты" ("ФИО", "Адрес", "Телефон")

SELECT DISTINCT "ДатаПоставки" FROM "Поставка";

SELECT DISTINCT "КодПоставщика" FROM "Поставка";

SELECT DISTINCT "Кол-во" FROM "Товары";

SELECT DISTINCT "КодПоставки" FROM "Товары";

SELECT DISTINCT "КодТовара" FROM "Заказы";

SELECT DISTINCT "КодСотрудника" FROM "Заказы";

SELECT DISTINCT "Адрес" FROM "Поставщик";

SELECT DISTINCT "Обращаться" FROM "Поставщик";

SELECT DISTINCT "Должность" FROM "Сотрудники";

SELECT DISTINCT "Должность", "Адрес" FROM "Сотрудники";

SELECT DISTINCT "Имя", "Отчество" FROM "Сотрудники";

SELECT DISTINCT "КодКлиента", "ФИО" FROM "Клиенты";

SELECT DISTINCT "Телефон", "Адрес" FROM "Клиенты";

SELECT "ДатаПоставки" FROM "Поставка" GROUP BY "ДатаПоставки";

SELECT AVG("СтоимостьЗакупки") FROM "Товары";

