SELECT * FROM "ИсторияЗапросов"
00:26:33
SELECT * FROM "Поставка"
00:26:13
SELECT * FROM "Поставщик"
00:25:54
INSERT INTO "Поставка" ("КодПоставщика", "ДатаПоставки") VALUES (1, '2024-10-21 19:00:00');
00:25:31
INSERT INTO "Поставка" ("КодПоставщика", "ДатаПоставки") VALUES (2, '2024-09-20 18:00:00');
00:25:19
INSERT INTO "Поставка" ("КодПоставщика", "ДатаПоставки") VALUES (3, '2024-08-19 17:00:00');
00:25:07
INSERT INTO "Поставка" ("КодПоставщика", "ДатаПоставки") VALUES (4, '2024-07-18 16:00:00');
00:24:54
INSERT INTO "Поставка" ("КодПоставщика", "ДатаПоставки") VALUES (5, '2024-06-17 15:00:00');
00:24:41
INSERT INTO "Поставка" ("КодПоставщика", "ДатаПоставки") VALUES (6, '2024-05-16 14:00:00');
00:24:28
INSERT INTO "Поставка" ("КодПоставщика", "ДатаПоставки") VALUES (7, '2024-04-15 13:00:00');
00:24:11
SELECT * FROM "ИсторияЗапросов"
00:22:55
INSERT INTO "Поставка" ("КодПоставщика", "ДатаПоставки") VALUES (8, '2024-03-14 12:00:00');
00:22:29
INSERT INTO "ИсторияЗапросов" ("ТекстЗапроса") VALUES ('INSERT INTO "Поставщик" ("НазваниеПоставщика", "ПредставительПоставщика", "Обращаться", "КонтактныйТелефон", "Адрес") VALUES ("ООО "Альянс", "Алексеев Р. И.", "с 10 до 18", "+7-495-334-13-01", "ул. Расковой, д. 21");');
00:21:23
INSERT INTO "ИсторияЗапросов" ("ТекстЗапроса") VALUES ('''INSERT INTO "Поставщик" ("НазваниеПоставщика", "ПредставительПоставщика", "Обращаться", "КонтактныйТелефон", "Адрес") VALUES ('ООО "Альянс"', 'Алексеев Р. И.', 'с 10 до 18', '+7-495-334-13-01', 'ул. Расковой, д. 21');''')
00:17:04
INSERT INTO "ИсторияЗапросов" ("ТекстЗапроса") VALUES ('INSERT INTO "Поставщик" ("НазваниеПоставщика", "ПредставительПоставщика", "Обращаться", "КонтактныйТелефон", "Адрес") VALUES ('ООО "Альянс"', 'Алексеев Р. И.', 'с 10 до 18', '+7-495-334-13-01', 'ул. Расковой, д. 21');')
00:16:37
CREATE TRIGGER триггер_логирования AFTER INSERT OR UPDATE OR DELETE ON "ИсторияЗапросов" FOR EACH ROW EXECUTE FUNCTION логировать_запрос();
00:13:58
CREATE TRIGGER триггер_логирования AFTER INSERT OR UPDATE OR DELETE OR SELECT OR CREATE ON "ИсторияЗапросов" FOR EACH ROW EXECUTE FUNCTION логировать_запрос();
00:11:53
CREATE TRIGGER триггер_логирования AFTER INSERT OR UPDATE ON "ИсторияЗапросов" FOR EACH ROW EXECUTE FUNCTION логировать_запрос();
00:09:54
CREATE OR REPLACE FUNCTION логировать_запрос() RETURNS TRIGGER AS $$ BEGIN INSERT INTO "ИсторияЗапросов" ("ТекстЗапроса") VALUES (current_query()); RETURN NEW; END; $$ LANGUAGE plpgsql;
00:08:14
CREATE OR REPLACE FUNCTION логировать_запрос() RETURNS TRIGGER AS $$ BEGIN INSERT INTO "ИсторияЗапросов" ("ТекстЗапроса") VALUES (current_query());
00:04:26
BEGIN FOR obj IN SELECT * FROM pg_event_trigger_ddl_commands() LOOP IF obj.command_tag IN ('SELECT', 'INSERT', 'UPDATE', 'DELETE') THEN INSERT INTO query_history (query_text) VALUES (obj.object_identity);
23:57:16
CREATE OR REPLACE FUNCTION log_query() RETURNS event_trigger AS $$ DECLARE obj RECORD;
23:56:34
CREATE OR REPLACE FUNCTION log_query() RETURNS event_trigger AS $$ DECLARE obj RECORD;
23:49:16
CREATE OR REPLACE FUNCTION log_query() RETURNS event_trigger AS $$ DECLARE obj RECORD;
23:08:51
BEGIN FOR obj IN SELECT * FROM pg_event_trigger_ddl_commands() LOOP IF obj.command_tag IN ('SELECT', 'INSERT', 'DELETE', 'UPDATE') THEN INSERT INTO "История запросов" ("КодЗапроса") VALUES (obj.object_identity);
23:01:50
CREATE TABLE "История запросов" ( "КодЗапроса" SERIAL PRIMARY KEY, "ТекстЗапроса" TEXT NOT NULL, "ВремяЗапроса" TIMESTAMP DEFAULT CURRENT_TIMESTAMP );
22:53:01
CREATE TABLE "История запросов" ( "КодЗапроса" SERIAL PRIMARY KEY "ТекстЗапроса" TEXT NOT NULL "ВремяЗапроса" TIMESTAMP DEFAULT CURRENT_TIMESTAMP );
22:52:08
INSERT INTO "Поставка" ("КодПоставщика", "ДатаПоставки") VALUES (9, '2024-02-13 11:00:00');
22:28:05
SELECT * FROM "Поставка"
22:25:56
SELECT * FROM 'Поставка'
22:25:42
INSERT INTO "Поставка" ("КодПоставщика", "ДатаПоставки") VALUES (10, '2024-01-12 10:00:00');
22:25:10
INSERT INTO "Поставка" ("КодПоставщика", "ДатаПоставки") VALUES (10, '2024-01-12 10-00-00');
22:23:19
SELECT * FROM "Поставщик"
22:18:15
INSERT INTO "Поставщик" ("НазваниеПоставщика", "ПредставительПоставщика", "Обращаться", "КонтактныйТелефон", "Адрес") VALUES ('ООО "Фортуна"', 'Егоров И. К.', 'с 11 до 17', '+7-495-940-24-42', 'ул. Новослободская, д. 30');
22:17:53
INSERT INTO "Поставщик" ("НазваниеПоставщика", "ПредставительПоставщика", "Обращаться", "КонтактныйТелефон", "Адрес") VALUES ('ООО "Виктория"', 'Орлова В. И.', 'с 10 до 17', '+7-495-783-25-66', 'ул. Беговая, д. 29');
22:16:39
INSERT INTO "Поставщик" ("НазваниеПоставщика", "ПредставительПоставщика", "Обращаться", "КонтактныйТелефон", "Адрес") VALUES ('ООО "Авангард"', 'Макаров Л. Т.', 'с 9 до 17', '+7-499-903-33-01', 'ул. Фадеева, д. 28');
22:15:36
INSERT INTO "Поставщик" ("НазваниеПоставщика", "ПредставительПоставщика", "Обращаться", "КонтактныйТелефон", "Адрес") VALUES ('ООО "Прогресс"', 'Шевченко Р. О.', 'с 10 до 17', '+7-498-989-40-10', 'ул. Ходынская, д. 27');
22:14:12
INSERT INTO "Поставщик" ("НазваниеПоставщика", "ПредставительПоставщика", "Обращаться", "КонтактныйТелефон", "Адрес") VALUES ('ООО "Спектр"', 'Семенов В. В.', 'с 10-30 до 17-30', '+7-495-476-73-36', 'ул. Красина, д. 26');
22:13:05
INSERT INTO "Поставщик" ("НазваниеПоставщика", "ПредставительПоставщика", "Обращаться", "КонтактныйТелефон", "Адрес") VALUES ('ООО "Лидер"', 'Павлов А. Ю.', 'с 12 до 15', '+7-498-669-25-49', 'ул. Грузинский пер., д. 25');
22:11:57
INSERT INTO "Поставщик" ("НазваниеПоставщика", "ПредставительПоставщика", "Обращаться", "КонтактныйТелефон", "Адрес") VALUES ('ООО "Орион"', 'Александрова А. П.', 'с 8 до 16', '+7-499-934-04-21', 'ул. Пресненский Вал, д. 24');
22:10:40
INSERT INTO "Поставщик" ("НазваниеПоставщика", "ПредставительПоставщика", "Обращаться", "КонтактныйТелефон", "Адрес") VALUES ('ООО "Феникс"', 'Федоров О. Ф.', 'с 9 до 16', '+7-495-035-73-67', 'ул. Лесная, д. 23');
22:09:36
INSERT INTO "Поставщик" ("НазваниеПоставщика", "ПредставительПоставщика", "Обращаться", "КонтактныйТелефон", "Адрес") VALUES ('ООО "Вектор"', 'Михайлов П. В.', 'с 11 до 17', '+7-495-934-11-42', 'ул. Правды, д. 22');
22:08:15
INSERT INTO "Поставщик" ("НазваниеПоставщика", "ПредставительПоставщика", "Обращаться", "КонтактныйТелефон", "Адрес") VALUES ('ООО "Альянс"', 'Алексеев Р. И.', 'с 10 до 18', '+7-495-334-13-01', 'ул. Расковой, д. 21');

CREATE INDEX goods ON "Товары" ("НаименованиеТовара", "ТехническиеХарактеристики", "Описание");
20:47:35
CREATE INDEX employee ON "Сотрудники" ("Фамилия", "Имя", "Должность");
20:46:26
CREATE INDEX supplier ON "Поставщик" ("НазваниеПоставщика", "ПредставительПоставщика", "Обращаться");
20:45:08
CREATE INDEX supply ON "Поставка" ("КодПоставки", "КодПоставщика", "ДатаПоставки");
20:32:26
CREATE INDEX orders ON "Заказы" ("КодТовара", "ДатаРазмещения", "ДатаИсполнения");
20:30:59
CREATE INDEX clients ON "Клиенты" ("ФИО", "Адрес", "Телефон")
19:24:43
SELECT DISTINCT "ДатаПоставки" FROM "Поставка";
19:18:57
SELECT DISTINCT "КодПоставщика" FROM "Поставка";
19:18:42
SELECT DISTINCT "Кол-во" FROM "Товары";
19:18:09
SELECT DISTINCT "КодПоставки" FROM "Товары";
19:17:47
SELECT DISTINCT "КодТовара" FROM "Заказы";
19:17:11
SELECT DISTINCT "КодСотрудника" FROM "Заказы";
19:16:53
SELECT DISTINCT "Адрес" FROM "Поставщик";
19:16:23
SELECT DISTINCT "Обращаться" FROM "Поставщик";
19:16:13
SELECT DISTINCT "Должность" FROM "Сотрудники";
19:15:35
SELECT DISTINCT "Должность", "Адрес" FROM "Сотрудники";
19:15:20
SELECT DISTINCT "Имя", "Отчество" FROM "Сотрудники";
19:14:53
SELECT DISTINCT "КодКлиента", "ФИО" FROM "Клиенты";
19:14:23
SELECT DISTINCT "Телефон", "Адрес" FROM "Клиенты";
19:14:01
SELECT "ДатаПоставки" FROM "Поставка" GROUP BY "ДатаПоставки";
19:12:23
SELECT "КодПоставщика" FROM "Поставка" GROUP BY "КодПоставщика";
19:12:10
SELECT "Наличие" FROM "Товары" GROUP BY "Наличие";
19:10:34
SELECT "КодПоставки" FROM "Товары" GROUP BY "КодПоставки";
19:09:57
SELECT "КодСотрудника" FROM "Заказы" GROUP BY "КодСотрудника";
19:09:26
SELECT "КодТовара" FROM "Заказы" GROUP BY "КодТовара";
19:09:06
SELECT "Обращаться" FROM "Поставщик" GROUP BY "Обращаться";
19:08:23
SELECT "НазваниеПоставщика" FROM "Поставщик" GROUP BY "НазваниеПоставщика";
19:08:13
SELECT "Должность" FROM "Сотрудники" GROUP BY "Должность";
19:07:22
SELECT "Имя" FROM "Сотрудники" GROUP BY "Имя";
19:07:11
SELECT "Адрес" FROM "Клиенты" GROUP BY "Адрес";
19:05:35
SELECT "ФИО", "Адрес" FROM "Клиенты" GROUP BY "Адрес";
19:05:07
SELECT "ФИО" FROM "Клиенты" GROUP BY "ФИО";
19:04:12
SELECT * FROM "Клиенты" GROUP BY "ФИО";
18:59:19
SELECT "КодПоставки", "ДатаПоставки", "НазваниеПоставщика", "КонтактныйТелефон" FROM "Поставка" INNER JOIN "Поставщик" ON "Поставка"."КодПоставщика" = "Поставщик"."КодПоставщика" ORDER BY "Поставщик"."КодПоставщика" ASC;
18:54:56
SELECT "КодПоставки", "ДатаПоставки", "НазваниеПоставщика", "КонтактныйТелефон" FROM "Поставка" INNER JOIN "Поставщик" ON "Поставка"."КодПоставщика" = "Поставщик"."КодПоставщика" ORDER BY "ДатаПоставки" DESC;
18:54:24
SELECT * FROM "Товары" ORDER BY "СтоимостьЗакупки" DESC;
18:52:47
SELECT * FROM "Товары" ORDER BY "НаименованиеТовара";
18:52:31
SELECT "Товары"."НаименованиеТовара", "ДатаРазмещения", "ДатаИсполнения" FROM "Заказы" INNER JOIN "Товары" ON "Заказы"."КодТовара" = "Товары"."КодТовара" ORDER BY "Товары"."КодТовара";
18:49:55
SELECT "Товары"."НаименованиеТовара", "ДатаРазмещения", "ДатаИсполнения" FROM "Заказы" INNER JOIN "Товары" ON "Заказы"."КодТовара" = "Товары"."КодТовара" ORDER BY "КодТовара";
18:48:42
SELECT "Товары"."НаименованиеТовара", "ДатаРазмещения", "ДатаИсполнения" FROM "Заказы" INNER JOIN "Товары" ON "Заказы"."КодТовара" = "Товары"."КодТовара" ORDER BY "КодЗаказа" DESC;
18:46:33
SELECT "Товары"."НаименованиеТовара", "ДатаРазмещения", "ДатаИсполнения" FROM "Заказы" ORDER BY "КодЗаказа" DESC INNER JOIN "Товары" ON "Заказы"."КодТовара" = "Товары"."КодТовара";
18:46:20
SELECT "Товары"."НаименованиеТовара", "ДатаРазмещения", "ДатаИсполнения" FROM "Заказы" ORDER BY "КодЗаказа" DESC;
18:44:41
SELECT * FROM "Поставщик" ORDER BY "Адрес" ASC;
18:43:03
SELECT * FROM "Поставщик" ORDER BY "НазваниеПоставщика" DESC;
18:42:37
SELECT * FROM "Сотрудники" ORDER BY "Имя" DESC;
18:41:31
SELECT * FROM "Сотрудники" ORDER BY "Имя";
18:41:18
SELECT * FROM "Клиенты" ORDER BY "ФИО";
18:38:36
SELECT * FROM "Клиенты" ORDER BY "КодКлиента" DESC;
18:38:01
SELECT "КодПоставки", "ДатаПоставки", "НазваниеПоставщика", "КонтактныйТелефон" FROM "Поставка" INNER JOIN "Поставщик" ON "Поставка"."КодПоставщика" = "Поставщик"."КодПоставщика" WHERE "ДатаПоставки" > '2024-04-15';
18:34:57
SELECT "НаименованиеТовара", "ТехническиеХарактеристики", "Наличие", "Кол-во" FROM "Товары" WHERE "Кол-во" < 10;
18:30:22
SELECT "НаименованиеТовара", "ТехническиеХарактеристики", "Описание", "Кол-во" FROM "Товары" WHERE "Кол-во" > 5;
18:29:36
SELECT "НаименованиеТовара", "ТехническиеХарактеристики", "Описание", "Кол-во" FROM "Товары" WHERE "Кол-во" > 2;
18:29:23
SELECT "Товары"."НаименованиеТовара", "ДатаРазмещения", "ДатаИсполнения", "Товары"."Наличие" FROM "Заказы" INNER JOIN "Товары" ON "Заказы"."КодТовара" = "Товары"."КодТовара" WHERE "Товары"."Наличие" != FALSE;
18:27:42
SELECT "Товары"."НаименованиеТовара", "ДатаРазмещения", "ДатаИсполнения" FROM "Заказы" INNER JOIN "Товары" ON "Заказы"."КодТовара" = "Товары"."КодТовара" WHERE "Товары"."Кол-во" > 5;
18:26:03
SELECT "Товары"."НаименованиеТовара", "ДатаРазмещения", "ДатаИсполнения" FROM "Заказы" WHERE "Товары"."Кол-во" > 5 INNER JOIN "Товары" ON "Заказы"."КодТовара" = "Товары"."КодТовара";
18:25:40
INNER JOIN "Товары" ON "Заказы"."КодТовара" = "Товары"."КодТовара" WHERE "Товары"."Кол-во" > 5;
18:25:12
SELECT "Товары"."НаименованиеТовара", "ДатаРазмещения", "ДатаИсполнения" FROM "Заказы" WHERE "Товары"."Кол-во" > 5 INNER JOIN "Товары" ON "Заказы"."КодТовара" = "Товары"."КодТовара";
18:24:36
SELECT "НазваниеПоставщика", "ПредставительПоставщика", "Обращаться", "КонтактныйТелефон" FROM "Поставщик" WHERE "Обращаться" LIKE '%до 17';
18:19:34
SELECT "НазваниеПоставщика", "Адрес" FROM "Поставщик" WHERE "Адрес" LIKE 'ул. П%';
18:17:40
SELECT "Название", "Адрес" FROM "Поставщик" WHERE "Адрес" LIKE 'ул. П%';
18:17:12
SELECT "Фамилия", "Имя", "Адрес" FROM "Сотрудники" WHERE "Адрес" LIKE '%, д. 1%';
18:15:15
SELECT "Фамилия", "Имя", "Должность" FROM "Сотрудники" WHERE "ДатаРождения" >= '1977-08-03';
18:13:30
SELECT "Фамилия", "Имя", "Должность" FROM "Сотрудники" WHERE "ДатаРождения" >= 1977-08-03;
18:13:01
SELECT "ФИО", "Адрес" FROM "Клиенты" WHERE "КодКлиента" >= 3;
18:11:02
SELECT "КодКлиента" FROM "Клиенты" WHERE "КодКлиента" <= 8;
18:10:20
SELECT "КодКиента" FROM "Клиенты" WHERE "КодКиента" <= 8;
18:10:10
UPDATE "Поставка" SET "ДатаПоставки" = '2024-04-15 13:00:55' WHERE "ДатаПоставки" = '2024-04-15 13:00:00';
18:05:22
UPDATE "Поставка" SET "ДатаПоставки" = '2024-03-14 12:00:55' WHERE "ДатаПоставки" = '2024-03-14 12:00:00';
18:05:07
UPDATE "Поставка" SET "ДатаПоставки" = '2024-02-13 11:00:55' WHERE "ДатаПоставки" = '2024-02-13 11:00:00';
18:04:52
UPDATE "Поставка" SET "ДатаПоставки" = '2024-01-12 10:00:55' WHERE "ДатаПоставки" = '2024-01-12 10:00:00';
18:04:36
UPDATE "Товары" SET "СтоимостьЗакупки" = 505 WHERE "СтоимостьЗакупки" = 500;
18:00:57
UPDATE "Товары" SET "СтоимостьПродажи" = 620 WHERE "СтоимостьПродажи" = 610;
17:59:53
UPDATE "Товары" SET "СтоимостьПродажи" = 620 WHERE "СтоиСтоимостьПродажимостьЗакупки" = 610;
17:59:44
UPDATE "Товары" SET "СтоимостьЗакупки" = 500 WHERE "СтоимостьЗакупки" = 505;
17:59:01
UPDATE "Товары" SET "Описание" = 'ОпИсаниеТовара2' WHERE "Описание" = 'ОписаниеТовара2';
17:58:27
UPDATE "Товары" SET "ТехническиеХарактеристики" = 'ХарактеристикиТовара1' WHERE "ТехническиеХарактеристики" = 'Хар-киТовара1';
17:57:40
UPDATE "Заказы" SET "ДатаИсполнения" = '2024-11-05 13:00:30' WHERE "ДатаИсполнения" = '2024-11-05 13:00:00';
17:54:16
UPDATE "Заказы" SET "ДатаИсполнения" = '2024-11-04 14:00:30' WHERE "ДатаИсполнения" = '2024-11-04 14:00:00';
17:53:52
UPDATE "Заказы" SET "ДатаРазмещения" = '2024-11-02 11:00:30' WHERE "ДатаРазмещения" = '2024-11-02 11:00:00';
17:53:13
UPDATE "Заказы" SET "ДатаРазмещения" = '2024-11-01 10:00:30' WHERE "ДатаРазмещения" = '2024-11-01 10:00:00';
17:52:39
UPDATE "Поставщик" SET "Адрес" = 'ул. Пресненский Вал, д. 24в' WHERE "Адрес" = 'ул. Пресненский Вал, д. 24';
17:49:45
UPDATE "Поставщик" SET "КонтактныйТелефон" = '+7-495-035-73-55' WHERE "КонтактныйТелефон" = '+7-495-035-73-55';
17:48:51
UPDATE "Поставщик" SET "Обращаться" = 'с 11:30 до 17' WHERE "Обращаться" = 'с 11 до 17';
17:48:09
UPDATE "Поставщик" SET "НазваниеПоставщика" = 'ООО "Альянс и Ко"' WHERE "НазваниеПоставщика" = 'ООО "Альянс"';
17:47:04
UPDATE "Сотрудники" SET "ДатаРождения" = '1977-04-21' WHERE "ДатаРождения" = '1977-04-04';
16:19:03
UPDATE "Сотрудники" SET "ДатаРождения" = '1977-04-21 WHERE "ДатаРождения" = '1977-04-04';
16:18:45
UPDATE "Сотрудники" SET "ДомашнийТелефон" = '+7-916-403-53-89' WHERE "ДомашнийТелефон" = '+7-916-403-53-93';
16:18:01
UPDATE "Сотрудники" SET "Адрес" = 'ул. Перерва, д. 2/1, кв. 2' WHERE "Адрес" = 'ул. Перерва, д. 2, кв. 2';
16:17:17
UPDATE "Сотрудники" SET "Должность" = 'генеральный директор' WHERE "Должность" = 'директор';
16:16:37
UPDATE "Клиенты" SET "Адрес" = 'ул. Делегатская, д. 20, к. 1, кв. 20' WHERE "Адрес" = 'ул. Делегатская, д. 20, кв. 20';
16:14:54
UPDATE "Клиенты" SET "ФИО" = 'Сергеев В. В.' WHERE "ФИО" = 'Сергеев В. С.';
16:13:34
UPDATE "Клиенты" SET "Телефон" = '+7-905-235-32-55' WHERE "Телефон" = '+7-905-235-32-57';
16:12:44
UPDATE "Клиенты" SET "Телефон" = '+7-905-235-32-55' WHERE "Адрес" = '+7-905-235-32-57';
16:12:18
UPDATE "Клиенты" SET "Адрес" = 'ул. Советской Армии, д. 11а, кв. 11' WHERE "Адрес" = 'ул. Советской Армии, д. 11, кв. 11';
16:11:03
UPDATE "Клиенты" SET "Адрес" = "ул. Советской Армии, д. 11а, кв. 11" WHERE "Адрес" = 'ул. Советской Армии, д. 11, кв. 11';
16:10:52
UPDATE "Клиенты" SET "Адрес" = "ул. Советской Армии, д. 11а, кв. 11" WHERE "Адрес" = "ул. Советской Армии, д. 11, кв. 11";
16:10:13
UPDATE "Клиенты" SET "Адрес" = "ул. Советской Армии, д. 11а, кв. 11" WHERE "Адрес" = "ул. Советской Армии, д. 11, кв. 11";
16:05:05
UPDATE "Клиенты" SET "Адрес" = ""ул. Советской Армии, д. 11а, кв. 11"" WHERE "Адрес" = ""ул. Советской Армии, д. 11, кв. 11"";
16:04:52
SELECT "ДатаПоставки", "НазваниеПоставщика", "НаименованиеТовара", "СтоимостьЗакупки", "ДатаРазмещения", "ДатаИсполнения" FROM "Поставка" RIGHT JOIN "Товары" ON "Поставка"."КодПоставки" = "Товары"."КодПоставки" FULL OUTER JOIN "Поставщик" ON "Поставка"."КодПоставщика" = "Поставщик"."КодПоставщика" LEFT JOIN "Заказы" ON "Товары"."КодТовара" = "Заказы"."КодТовара";
15:45:57
SELECT "ДатаПоставки", "НазваниеПоставщика", "НаименованиеТовара", "СтоимостьЗакупки", "ДатаРазмещения", "ДатаИсполнения" FROM "Поставка" FULL OUTER JOIN "Товары" ON "Поставка"."КодПоставки" = "Товары"."КодПоставки" LEFT JOIN "Поставщик" ON "Поставка"."КодПоставщика" = "Поставщик"."КодПоставщика" RIGHT JOIN "Заказы" ON "Товары"."КодТовара" = "Заказы"."КодТовара";
15:45:29
SELECT "ДатаПоставки", "НазваниеПоставщика", "НаименованиеТовара", "СтоимостьЗакупки", "ДатаРазмещения", "ДатаИсполнения" FROM "Поставка" LEFT JOIN "Товары" ON "Поставка"."КодПоставки" = "Товары"."КодПоставки" RIGHT JOIN "Поставщик" ON "Поставка"."КодПоставщика" = "Поставщик"."КодПоставщика" FULL OUTER JOIN "Заказы" ON "Товары"."КодТовара" = "Заказы"."КодТовара";
15:44:41
SELECT "ДатаПоставки", "НазваниеПоставщика", "НаименованиеТовара", "СтоимостьЗакупки", "ФИО", "Телефон" FROM "Поставка" LEFT JOIN "Товары" ON "Поставка"."КодПоставки" = "Товары"."КодПоставки" RIGHT JOIN "Поставщик" ON "Поставка"."КодПоставщика" = "Поставщик"."КодПоставщика" FULL OUTER JOIN "Заказы" ON "Товары"."КодТовара" = "Заказы"."КодТовара";
15:43:54
SELECT "ДатаПоставки", "НазваниеПоставщика", "НаименованиеТовара", "СтоимостьЗакупки", "ФИО", "Телефон" FROM "Поставка" LEFT JOIN "Товары" ON "Поставка"."КодПоставки" = "Товары"."КодПоставки" RIGHT JOIN "Поставщик" ON "Поставка"."КодПоставщика" = "Поставщик"."КодПоставщика" FROM "Заказы" FULL OUTER JOIN "Клиенты" ON "Клиенты"."КодКлиента" = "Заказы"."КодКлиента" FULL OUTER JOIN "Товары" ON "Товары"."КодТовара" = "Заказы"."КодТовара";
15:43:00
SELECT "ДатаПоставки", "НазваниеПоставщика", "НаименованиеТовара", "СтоимостьЗакупки", "ФИО", "Телефон" FROM "Поставка" LEFT JOIN "Товары" ON "Поставка"."КодПоставки" = "Товары"."КодПоставки" RIGHT JOIN "Поставщик" ON "Поставка"."КодПоставщика" = "Поставщик"."КодПоставщика" FULL OUTER JOIN "Клиенты" ON "Клиенты"."КодКлиента" = "Заказы"."КодКлиента" FULL OUTER JOIN "Товары" ON "Товары"."КодТовара" = "Заказы"."КодТовара";
15:41:33
SELECT "ДатаПоставки", "НазваниеПоставщика", "НаименованиеТовара", "СтоимостьЗакупки", "ФИО", "Телефон" FROM "Поставка" LEFT JOIN "Товары" ON "Поставка"."КодПоставки" = "Товары"."КодПоставки" RIGHT JOIN "Поставщик" ON "Товары"."КодПоставщика" = "Поставщик"."КодПоставщика" FULL OUTER JOIN "Клиенты" ON "Клиенты"."КодКлиента" = "Заказы"."КодКлиента" FULL OUTER JOIN "Товары" ON "Товары"."КодТовара" = "Заказы"."КодТовара";
15:40:46
FULL OUTER JOIN "Товары" ON "Товары"."КодТовара" = "Заказы"."КодТовара";
15:40:25
SELECT "НаименованиеТовара", "СтоимостьЗакупки", "СтоимостьПродажи", "Поставка"."ДатаПоставки", "Поставщик"."НазваниеПоставщика", "Заказы"."ДатаИсполнения" FROM "Товары" LEFT JOIN "Поставка" ON "Товары"."КодПоставки" = "Поставка"."КодПоставки" RIGHT JOIN "Поставщик" ON "Поставка"."КодПоставщика" = "Поставщик"."КодПоставщика" FULL OUTER JOIN "Заказы" ON "Товары"."КодТовара" = "Заказы"."КодТовара";
15:06:15
SELECT "НаименованиеТовара", "СтоимостьЗакупки", "СтоимостьПродажи", "Поставка"."ДатаПоставки", "Поставщик"."НазваниеПоставщика", "Заказы"."ДатаИсполнения" FROM "Товары" FULL OUTER JOIN "Поставка" ON "Товары"."КодПоставки" = "Поставка"."КодПоставки" LEFT JOIN "Поставщик" ON "Поставка"."КодПоставщика" = "Поставщик"."КодПоставщика" RIGHT JOIN "Заказы" ON "Товары"."КодТовара" = "Заказы"."КодТовара";
15:05:43
SELECT "НаименованиеТовара", "СтоимостьЗакупки", "СтоимостьПродажи", "Поставка"."ДатаПоставки", "Поставщик"."НазваниеПоставщика", "Заказы"."ДатаИсполнения" FROM "Товары" RIGHT JOIN "Поставка" ON "Товары"."КодПоставки" = "Поставка"."КодПоставки" FULL OUTER JOIN "Поставщик" ON "Поставка"."КодПоставщика" = "Поставщик"."КодПоставщика" LEFT JOIN "Заказы" ON "Товары"."КодТовара" = "Заказы"."КодТовара";
15:04:55
SELECT "КодЗаказа", "Товары"."НаименованиеТовара", "ФИО", "Сотрудники"."Фамилия", "Сотрудники"."Должность" FROM "Заказы" RIGHT JOIN "Клиенты" ON "Заказы"."КодКлиента" = "Клиенты"."КодКлиента" FULL OUTER JOIN "Товары" ON "Заказы"."КодТовара" = "Товары"."КодТовара" LEFT JOIN "Сотрудники" ON "Заказы"."КодСотрудника" = "Сотрудники"."КодСотрудника";
14:57:46
SELECT "КодЗаказа", "Товары"."НаименованиеТовара", "ФИО", "Сотрудники"."Фамилия", "Сотрудники"."Должность" FROM "Заказы" FULL OUTER JOIN "Клиенты" ON "Заказы"."КодКлиента" = "Клиенты"."КодКлиента" LEFT JOIN "Товары" ON "Заказы"."КодТовара" = "Товары"."КодТовара" RIGHT JOIN "Сотрудники" ON "Заказы"."КодСотрудника" = "Сотрудники"."КодСотрудника";
14:57:17
SELECT "КодЗаказа", "Товары"."НаименованиеТовара", "ФИО", "Сотрудники"."Фамилия", "Сотрудники"."Должность" FROM "Заказы" LEFT JOIN "Клиенты" ON "Заказы"."КодКлиента" = "Клиенты"."КодКлиента" RIGHT JOIN "Товары" ON "Заказы"."КодТовара" = "Товары"."КодТовара" FULL OUTER JOIN "Сотрудники" ON "Заказы"."КодСотрудника" = "Сотрудники"."КодСотрудника";
14:56:33
SELECT "КодЗаказа", "Товары"."НаименованиеТовара", "ФИО", "Сотрудники"."Фамилия", "Сотрудники"."Должность" FROM "Заказы" INNER JOIN "Клиенты" ON "Заказы"."КодКлиента" = "Клиенты"."КодКлиента" INNER JOIN "Товары" ON "Заказы"."КодТовара" = "Товары"."КодТовара" INNER JOIN "Сотрудники" ON "Заказы"."КодСотрудника" = "Сотрудники"."КодСотрудника";
14:56:00
INNER JOIN "Сотрудники" ON "Заказы"."КодСотрудника" = "Сотрудники"."КодСотрудника";
14:55:48
SELECT "КодЗаказа", "Товары"."НаименованиеТовара", "ФИО", "СтоимостьЗакупки", "СтоимостьПродажи" FROM "Заказы" FULL OUTER JOIN "Клиенты" ON "Заказы"."КодКлиента" = "Клиенты"."КодКлиента" FULL OUTER JOIN "Товары" ON "Заказы"."КодТовара" = "Товары"."КодТовара";
14:48:47
SELECT "КодЗаказа", "Товары"."НаименованиеТовара", "ФИО", "СтоимостьЗакупки", "СтоимостьПродажи" FROM "Заказы" RIGHT JOIN "Клиенты" ON "Заказы"."КодКлиента" = "Клиенты"."КодКлиента" LEFT JOIN "Товары" ON "Заказы"."КодТовара" = "Товары"."КодТовара";
14:48:21
SELECT "КодЗаказа", "Товары"."НаименованиеТовара", "ФИО", "СтоимостьЗакупки", "СтоимостьПродажи" FROM "Заказы" LEFT JOIN "Клиенты" ON "Заказы"."КодКлиента" = "Клиенты"."КодКлиента" RIGHT JOIN "Товары" ON "Заказы"."КодТовара" = "Товары"."КодТовара";
14:48:06
SELECT "КодЗаказа", "Товары"."НаименованиеТовара", "ФИО", "СтоимостьЗакупки", "СтоимостьПродажи" FROM "Заказы" INNER JOIN "Клиенты" ON "Заказы"."КодКлиента" = "Клиенты"."КодКлиента" INNER JOIN "Товары" ON "Заказы"."КодТовара" = "Товары"."КодТовара";
14:47:33
SELECT "КодЗаказа", "Товары"."НаименованиеТовара", "ФИО", "СтоимостьЗакупки", "СтоимостьПродажи" FROM "Заказы" INNER JOIN "Клиенты", "Товары" ON "Заказы"."КодКлиента" = "Клиенты"."КодКлиента", "Заказы"."КодТовара" = "Товары"."КодТовара";
14:46:04
SELECT "КодЗаказа", "Товары"."НаименованиеТовара", "ФИО", "СтоимостьЗакупки", "СтоимостьПродажи" FROM "Заказы" INNER JOIN "Клиенты" ON "Заказы"."КодКлиента" = "Клиенты"."КодКлиента", "Заказы"."КодТовара" = "Товары"."КодТовара";
14:45:38
SELECT "КодЗаказа", "Товары"."НаименованиеТовара", "ФИО", "СтоимостьЗакупки", "СтоимостьПродажи" FROM "Заказы" INNER JOIN "Клиенты" ON "Заказы"."КодКлиента" = "Клиенты"."КодКлиента";
14:44:48
SELECT "НазваниеПоставщика", "ПредставительПоставщика", "Обращаться", "КонтактныйТелефон", "КодПоставки", "ДатаПоставки" FROM "Поставщик" FULL OUTER JOIN "Поставка" ON "Поставщик"."КодПоставщика" = "Поставка"."КодПоставщика";
14:26:01
SELECT "НазваниеПоставщика", "ПредставительПоставщика", "Обращаться", "КонтактныйТелефон", "КодПоставки", "ДатаПоставки" FROM "Поставщик" RIGHT JOIN "Поставка" ON "Поставщик"."КодПоставщика" = "Поставка"."КодПоставщика";
14:25:48
SELECT "НазваниеПоставщика", "ПредставительПоставщика", "Обращаться", "КонтактныйТелефон", "КодПоставки", "ДатаПоставки" FROM "Поставщик" LEFT JOIN "Поставка" ON "Поставщик"."КодПоставщика" = "Поставка"."КодПоставщика";
14:25:36
SELECT "НазваниеПоставщика", "ПредставительПоставщика", "Обращаться", "КонтактныйТелефон", "КодПоставки", "ДатаПоставки" FROM "Поставщик" INNER JOIN "Поставка" ON "Поставщик"."КодПоставщика" = "Поставка"."КодПоставщика";
14:24:41
SELECT "НазваниеПоставщика", "КодПоставки" FROM "Поставщик" FULL OUTER JOIN "Поставка" ON "Поставщик"."КодПоставщика" = "Поставка"."КодПоставщика";
14:21:59
SELECT "НазваниеПоставщика", "КодПоставки" FROM "Поставщик" RIGHT JOIN "Поставка" ON "Поставщик"."КодПоставщика" = "Поставка"."КодПоставщика";
14:21:46
SELECT "НазваниеПоставщика", "КодПоставки" FROM "Поставщик" LEFT JOIN "Поставка" ON "Поставщик"."КодПоставщика" = "Поставка"."КодПоставщика";
14:21:30
SELECT "НазваниеПоставщика", "КодПоставки" FROM "Поставщик" INNER JOIN "Поставка" ON "Поставщик"."КодПоставщика" = "Поставка"."КодПоставщика";
14:21:09
SELECT "Сотрудники"."КодСотрудника", "Фамилия", "Имя", "КодЗаказа", "КодТовара", "КодКлиента" FROM "Сотрудники" FULL OUTER JOIN "Заказы" ON "Сотрудники"."КодСотрудника" = "Заказы"."КодСотрудника";
14:17:47
SELECT "Сотрудники"."КодСотрудника", "Фамилия", "Имя", "КодЗаказа", "КодТовара", "КодКлиента" FROM "Сотрудники" RIGHT JOIN "Заказы" ON "Сотрудники"."КодСотрудника" = "Заказы"."КодСотрудника";
14:17:33
SELECT "Сотрудники"."КодСотрудника", "Фамилия", "Имя", "КодЗаказа", "КодТовара", "КодКлиента" FROM "Сотрудники" LEFT JOIN "Заказы" ON "Сотрудники"."КодСотрудника" = "Заказы"."КодСотрудника";
14:17:20
SELECT "Сотрудники"."КодСотрудника", "Фамилия", "Имя", "КодЗаказа", "КодТовара", "КодКлиента" FROM "Сотрудники" INNER JOIN "Заказы" ON "Сотрудники"."КодСотрудника" = "Заказы"."КодСотрудника";
14:17:02
SELECT "КодСотрудника", "Фамилия", "Имя", "КодЗаказа", "КодТовара", "КодКлиента" FROM "Сотрудники" INNER JOIN "Заказы" ON "Сотрудники"."КодСотрудника" = "Заказы"."КодСотрудника";
14:16:46
SELECT "Фамилия", "Имя", "Должность", "КодТовара", "ДатаРазмещения", "ДатаИсполнения" FROM "Сотрудники" FULL OUTER JOIN "Заказы" ON "Сотрудники"."КодСотрудника" = "Заказы"."КодСотрудника";
14:14:04
SELECT "Фамилия", "Имя", "Должность", "КодТовара", "ДатаРазмещения", "ДатаИсполнения" FROM "Сотрудники" RIGHT JOIN "Заказы" ON "Сотрудники"."КодСотрудника" = "Заказы"."КодСотрудника";
14:13:21
SELECT "Фамилия", "Имя", "Должность", "КодТовара", "ДатаРазмещения", "ДатаИсполнения" FROM "Сотрудники" LEFT JOIN "Заказы" ON "Сотрудники"."КодСотрудника" = "Заказы"."КодСотрудника";
14:13:01
SELECT "Фамилия", "Имя", "Должность", "КодТовара", "ДатаРазмещения", "ДатаИсполнения" FROM "Сотрудники" INNER JOIN "Заказы" ON "Сотрудники"."КодСотрудника" = "Заказы"."КодСотрудника";
14:11:00
SELECT "Фамилия", "Имя", "Должность", "КодТовара", "ДатаРазмещения", "ДатаИсполнения" FROM "Сотрудники" INNER JOIN "Сотрудники" ON "Сотрудники"."КодСотрудника" = "Сотрудники"."КодСотрудника";
14:10:26
SELECT "КодТовара", "ФИО" FROM "Заказы" RIGHT JOIN "Клиенты" ON "Заказы"."КодКлиента" = "Клиенты"."КодКлиента";
14:06:57
SELECT "ФИО", "КодТовара" FROM "Заказы" RIGHT JOIN "Клиенты" ON "Заказы"."КодКлиента" = "Клиенты"."КодКлиента";
14:06:39
SELECT "ФИО", "КодТовара" FROM "Заказы" RIGHT JOIN "Клиенты" ON "Клиенты"."КодКлиента" = "Заказы"."КодКлиента";
14:06:14
SELECT "ФИО", "КодТовара" FROM "Клиенты" RIGHT JOIN "Заказы" ON "Клиенты"."КодКлиента" = "Заказы"."КодКлиента";
14:05:45
SELECT "ФИО", "КодТовара" FROM "Клиенты" LEFT JOIN "Заказы" ON "Клиенты"."КодКлиента" = "Заказы"."КодКлиента";
14:05:19
SELECT * FROM "Клиенты"
14:03:30
SELECT * FROM "Заказы"
14:02:58
SELECT "ФИО", "КодТовара" FROM "Клиенты" INNER JOIN "Заказы" ON "Клиенты"."КодКлиента" = "Заказы"."КодКлиента";
14:02:07
SELECT "КодПоставщика", "ДатаПоставки" FROM "Поставка"
13:51:44
SELECT "НаименованиеТовара", "ТехническиеХарактеристики", "Описание" FROM "Товары"
13:50:58
SELECT "НаименованиеТовара", "СтоимостьЗакупки", "СтоимостьПродажи" FROM "Товары"
13:50:09
SELECT "КодЗаказа", "КодТовара" FROM "Заказы"
13:48:49
SELECT "ДатаРазмещения", "ДатаИсполнения", "КодСотрудника" FROM "Заказы"
13:48:01
SELECT "НазваниеПоставщика", "ПредставительПоставщика", "Обращаться", "КонтактныйТелефон" FROM "Поставщик"
13:46:36
SELECT "НазваниеПоставщика", "ПредставительПоставщика", "Обращаться" FROM "Поставщик"
13:46:10
SELECT "НазваниеПоставщика", "КонтактныйТелефон", "Адрес" FROM "Поставщик"
13:45:35
SELECT "Название", "КонтактныйТелефон", "Адрес" FROM "Поставщик"
13:45:20
SELECT "Фамилия", "ДатаРождения" FROM "Сотрудники"
13:44:30
SELECT "Имя", "Отчество", "Фамилия", "Должность" FROM "Сотрудники"
13:43:46
SELECT "КодКлиента", "Телефон", "Адрес" FROM "Клиенты"
13:40:17
SELECT "ФИО", "Адрес", "Телефон" FROM "Клиенты"
13:39:17
SELECT * FROM "Заказы"
13:30:30
INSERT INTO "Заказы" ("КодСотрудника", "КодТовара", "ДатаРазмещения", "ДатаИсполнения", "КодКлиента") VALUES (1, 10, '2024-11-10 19:00:00', '2024-11-11 19:00:00', 2);
13:30:07
INSERT INTO "Заказы" ("КодСотрудника", "КодТовара", "ДатаРазмещения", "ДатаИсполнения", "КодКлиента") VALUES (1, 6, '2024-11-09 18:00:00', '2024-11-10 18:00:00', 9);
13:29:41
INSERT INTO "Заказы" ("КодСотрудника", "КодТовара", "ДатаРазмещения", "ДатаИсполнения", "КодКлиента") VALUES (2, 4, '2024-11-08 17:00:00', '2024-11-09 17:00:00', 4);
13:29:14
INSERT INTO "Заказы" ("КодСотрудника", "КодТовара", "ДатаРазмещения", "ДатаИсполнения", "КодКлиента") VALUES (2, 2, '2024-11-07 16:00:00', '2024-11-08 16:00:00', 6);
13:28:17
INSERT INTO "Заказы" ("КодСотрудника", "КодТовара", "ДатаРазмещения", "ДатаИсполнения", "КодКлиента") VALUES (3, 10, '2024-11-06 15:00:00', '2024-11-07 15:00:00', 7);
13:27:40
INSERT INTO "Заказы" ("КодСотрудника", "КодТовара", "ДатаРазмещения", "ДатаИсполнения", "КодКлиента") VALUES (3, 7, '2024-11-05 14:00:00', '2024-11-06 14:00:00', 8);
13:26:13
INSERT INTO "Заказы" ("КодСотрудника", "КодТовара", "ДатаРазмещения", "ДатаИсполнения", "КодКлиента") VALUES (4, 1, '2024-11-04 13:00:00', '2024-11-05 13:00:00', 1);
13:25:45
SELECT * FROM "Заказы"
13:23:25
INSERT INTO "Заказы" ("КодСотрудника", "КодТовара", "ДатаРазмещения", "ДатаИсполнения", "КодКлиента") VALUES (4, 8, '2024-11-03 12:00:00', '2024-11-04 14:00:00', 3);
13:22:30
INSERT INTO "Заказы" ("КодСотрудника", "КодТовара", "ДатаРазмещения", "ДатаИсполнения", "КодКлиента") VALUES (10, 5, '2024-11-02 11:00:00', '2024-11-03 11:00:00', 2);
13:21:41
INSERT INTO "Заказы" ("КодСотрудника", "КодТовара", "ДатаРазмещения", "ДатаИсполнения", "КодКлиента") VALUES (10, 3, '2024-11-01 10:00:00', '2024-11-02 10:00:00', 1);
13:20:45
INSERT INTO "Заказы" ("КодСотрудника", "КодТовара", "ДатаРазмещения", "ДатаИсполнения", "КодКлиента") VALUES (10, 'Товар3', '2024-11-01 10:00:00', '2024-11-02 10:00:00', 1);
13:20:12
SELECT * FROM "Сотрудники"
13:14:40
SELECT * FROM "Клиенты"
13:03:11
SELECT * FROM "Сотрудники"
13:02:58
SELECT * FROM "Товары"
13:01:55
INSERT INTO "Товары" ("КодПоставки", "НаименованиеТовара", "ТехническиеХарактеристики", "Описание", "Изображение", "СтоимостьЗакупки", "Наличие", "Кол-во", "СтоимостьПродажи") VALUES (7, 'Товар10', 'Хар-киТовара10', 'ОписаниеТовара10', E'\x28\x29\x30', 1200, TRUE, 12, 1210);
13:01:30
INSERT INTO "Товары" ("КодПоставки", "НаименованиеТовара", "ТехническиеХарактеристики", "Описание", "Изображение", "СтоимостьЗакупки", "Наличие", "Кол-во", "СтоимостьПродажи") VALUES (8, 'Товар9', 'Хар-киТовара9', 'ОписаниеТовара9', E'\x25\x26\x27', 1100, TRUE, 11, 1110);
13:00:47
INSERT INTO "Товары" ("КодПоставки", "НаименованиеТовара", "ТехническиеХарактеристики", "Описание", "Изображение", "СтоимостьЗакупки", "Наличие", "Кол-во", "СтоимостьПродажи") VALUES (5, 'Товар8', 'Хар-киТовара8', 'ОписаниеТовара8', E'\x22\x23\x24', 1000, TRUE, 10, 1010);
13:00:14
INSERT INTO "Товары" ("КодПоставки", "НаименованиеТовара", "ТехническиеХарактеристики", "Описание", "Изображение", "СтоимостьЗакупки", "Наличие", "Кол-во", "СтоимостьПродажи") VALUES (5, 'Товар7', 'Хар-киТовара7', 'ОписаниеТовара7', E'\x19\x20\x21', 900, TRUE, 9, 910);
12:59:25
INSERT INTO "Товары" ("КодПоставки", "НаименованиеТовара", "ТехническиеХарактеристики", "Описание", "Изображение", "СтоимостьЗакупки", "Наличие", "Кол-во", "СтоимостьПродажи") VALUES (3, 'Товар6', 'Хар-киТовара6', 'ОписаниеТовара6', E'\x16\x17\x18', 800, TRUE, 8, 810);
12:58:50
INSERT INTO "Товары" ("КодПоставки", "НаименованиеТовара", "ТехническиеХарактеристики", "Описание", "Изображение", "СтоимостьЗакупки", "Наличие", "Кол-во", "СтоимостьПродажи") VALUES (3, 'Товар5', 'Хар-киТовара5', 'ОписаниеТовара5', E'\x13\x14\x15', 700, TRUE, 7, 710);
12:58:21
INSERT INTO "Товары" ("КодПоставки", "НаименованиеТовара", "ТехническиеХарактеристики", "Описание", "Изображение", "СтоимостьЗакупки", "Наличие", "Кол-во", "СтоимостьПродажи") VALUES (3, 'Товар4', 'Хар-киТовара4', 'ОписаниеТовара4', E'\x10\x11\x12', 600, TRUE, 6, 610);
12:57:45
INSERT INTO "Товары" ("КодПоставки", "НаименованиеТовара", "ТехническиеХарактеристики", "Описание", "Изображение", "СтоимостьЗакупки", "Наличие", "Кол-во", "СтоимостьПродажи") VALUES (1, 'Товар3', 'Хар-киТовара3', 'ОписаниеТовара3', E'\x7\x8\x9', 500, TRUE, 5, 510);
12:57:00
INSERT INTO "Товары" ("КодПоставки", "НаименованиеТовара", "ТехническиеХарактеристики", "Описание", "Изображение", "СтоимостьЗакупки", "Наличие", "Кол-во", "СтоимостьПродажи") VALUES (1, 'Товар2', 'Хар-киТовара2', 'ОписаниеТовара2', E'\x4\x5\x6', 400, TRUE, 4, 410);
12:56:34
INSERT INTO "Товары" ("КодПоставки", "НаименованиеТовара", "ТехническиеХарактеристики", "Описание", "Изображение", "СтоимостьЗакупки", "Наличие", "Кол-во", "СтоимостьПродажи") VALUES (1, 'Товар1', 'Хар-киТовара1', 'ОписаниеТовара1', E'\x1\x2\x3', 300, TRUE, 3, 310);
12:55:53
SELECT * FROM "Поставка"
12:18:54
SELECT * FROM "ИсторияЗапросов"
00:26:33
SELECT * FROM "Поставка"
00:26:13
SELECT * FROM "Поставщик"
00:25:54
INSERT INTO "Поставка" ("КодПоставщика", "ДатаПоставки") VALUES (1, '2024-10-21 19:00:00');
00:25:31
INSERT INTO "Поставка" ("КодПоставщика", "ДатаПоставки") VALUES (2, '2024-09-20 18:00:00');
00:25:19
INSERT INTO "Поставка" ("КодПоставщика", "ДатаПоставки") VALUES (3, '2024-08-19 17:00:00');
00:25:07
INSERT INTO "Поставка" ("КодПоставщика", "ДатаПоставки") VALUES (3, 
'2024-08-19 17:00:00');
CREATE INDEX

UPDATE "Товары" SET "Кол-во" = '21' WHERE "Описание" = 'ОписаниеТовара7';
15:01:57
UPDATE "Товары" SET "Кол-во" = "21" WHERE "Описание" = 'ОписаниеТовара7';
15:01:49
UPDATE "Товары" SET "Кол-во" = "21" WHERE "Описание" = "ОписаниеТовара7";
15:01:35
CREATE TRIGGER total_cost BEFORE UPDATE OF "Кол-во" ON "Товары" FOR EACH ROW WHEN (NEW."Кол-во" IS DISTINCT FROM OLD."Кол-во") EXECUTE FUNCTION update_total_cost();
14:59:17
CREATE TRIGGER total_cost BEFORE INSERT OR UPDATE OF "Кол-во" ON "Товары" FOR EACH ROW WHEN (OLD."Кол-во" IS DISTINCT FROM NEW."Кол-во") EXECUTE FUNCTION update_total_cost();
14:52:03
CREATE OR REPLACE FUNCTION update_total_cost() RETURNS TRIGGER AS $total_cost$ BEGIN NEW."Общая сумма стоимости товара" := NEW."Кол-во" * NEW."СтоимостьПродажи"; RETURN NEW; END; $total_cost$ LANGUAGE plpgsql;
14:48:14
CREATE OR REPLACE FUNCTION update_total_cost() RETURNS TRIGGER AS $$ BEGIN NEW."Общая сумма стоимости товара" := NEW."Кол-во" * NEW."СтоимостьПродажи";
14:41:37
CREATE OR REPLACE FUNCTION update_total_cost RETURNS TRIGGER AS $$ BEGIN NEW."Общая сумма стоимости товара" := NEW."Кол-во" * NEW."СтоимостьПродажи"; RETURN NEW; END; $$ LANGUAGE plpgsql;
14:40:00
ALTER TABLE "Товары" ADD COLUMN "Общая сумма стоимости товара" INTEGER
14:19:32
TRUNCATE "ИсторияЗапросов";
14:12:37
DELETE FROM "Товары" WHERE "НаименованиеТовара" = 'Какое-то наименование';
14:10:39
INSERT INTO "Товары" ("НаименованиеТовара") VALUES ('Какое-то наименование');
14:08:49
INSERT INTO "ИсторияЗапросов" ("ТекстЗапроса") VALUES ('Текст');
14:06:22
INSERT INTO "ИсторияЗапросов" ("ТекстЗапроса") VALUES ('Текст');
14:05:15
INSERT INTO "ИсторияЗапросов" ("ТекстЗапроса") VALUES ("Текст");
14:05:00
SELECT COUNT("СтоимостьЗакупки") FROM "Товары";
13:59:24
SELECT MIN("СтоимостьЗакупки") FROM "Товары";
13:59:17
SELECT MAX("СтоимостьЗакупки") FROM "Товары";
13:59:01
SELECT COUNT("СтоимостьПродажи") FROM "Товары";
13:58:43
SELECT MIN("СтоимостьПродажи") FROM "Товары";
13:58:37
SELECT MAX("СтоимостьПродажи") FROM "Товары";
13:58:32
SELECT MAX("Наличие") FROM "Товары";
13:58:17
SELECT MIN("Наличие") FROM "Товары";
13:58:13
SELECT MIN("Наличие") FROM "Товары";
13:58:09
SELECT COUNT("Наличие") FROM "Товары";
13:58:04
SELECT COUNT("Кол-во") FROM "Товары";
13:57:48
SELECT MIN("Кол-во") FROM "Товары";
13:57:42
SELECT MAX("Кол-во") FROM "Товары";
13:57:36
SELECT MAX("КодПоставщика") FROM "Поставщик";
13:57:21
SELECT MIN("КодПоставщика") FROM "Поставщик";
13:57:15
SELECT COUNT("КодПоставщика") FROM "Поставщик";
13:57:02
SELECT COUNT("КодПоставщика") FROM "Поставщик";
13:56:30
SELECT MIN("КодПоставщика") FROM "Поставщик";
13:56:15
SELECT MAX("КодПоставщика") FROM "Поставщик";
13:56:06
SELECT MAX("КодПоставки") FROM "Поставка";
13:55:31
SELECT MIN("КодПоставки") FROM "Поставка";
13:55:25
SELECT COUNT("КодПоставки") FROM "Поставка";
13:55:18
SELECT MAX("КодСотрудника") FROM "Сотрудники";
13:55:05
SELECT MIN("КодСотрудника") FROM "Сотрудники";
13:54:58
SELECT COUNT("КодСотрудника") FROM "Сотрудники";
13:54:36
SELECT COUNT("КодЗаказа") FROM "Заказы";
13:54:13
SELECT MIN("КодЗаказа") FROM "Заказы";
13:54:07
SELECT MAX("КодЗаказа") FROM "Заказы";
13:54:02
SELECT COUNT("СтоимостьПродажи" - "СтоимостьЗакупки") FROM "Товары";
13:53:49
SELECT MIN("СтоимостьПродажи" - "СтоимостьЗакупки") FROM "Товары";
13:53:42
SELECT MAX("СтоимостьПродажи" - "СтоимостьЗакупки") FROM "Товары";
13:53:37
SELECT MAX("СтоимостьПродажи" - "СтоимостьЗакупки") FROM "Товары";
13:53:18
SELECT COUNT("СтоимостьЗакупки" - "СтоимостьПродажи") FROM "Товары";
13:53:00
SELECT MIN("СтоимостьЗакупки" - "СтоимостьПродажи") FROM "Товары";
13:52:47
SELECT MAX("СтоимостьЗакупки" - "СтоимостьПродажи") FROM "Товары";
13:52:38
SELECT AVG("СтоимостьЗакупки" - "СтоимостьПродажи") FROM "Товары";
13:52:01
SELECT AVG("СтоимостьПродажи" - "СтоимостьЗакупки") FROM "Товары";
13:51:50
SELECT AVG("СтоимостьПродажи" - "СтоимостьЗакупки") FROM "Товары";
13:51:36
SELECT AVG("КодЗаказа") FROM "Заказы";
13:51:21
SELECT AVG("КодСотрудника") FROM "Сотрудники";
13:51:08
SELECT AVG("КодПоставки") FROM "Поставка";
13:50:55
SELECT AVG("КодПоставщика") FROM "Поставщик";
13:50:39
SELECT AVG("Кол-во") FROM "Товары";
13:50:20
SELECT AVG("Наличие") FROM "Товары";
13:49:17
SELECT AVG("СтоимостьПродажи") FROM "Товары";
13:48:56
SELECT AVG("СтоимостьЗакупки") FROM "Товары";
13:48:40
SELECT SUM("СтоимостьЗакупки" - "СтоимостьПродажи") FROM "Товары";
13:37:02
SELECT SUM("СтоимостьПродажи" - "СтоимостьЗакупки") FROM "Товары";
13:36:46
SELECT SUM("КодЗаказа") FROM "Заказы";
13:34:32
SELECT SUM("КодСотрудника") FROM "Сотрудники";
13:33:46
SELECT SUM("КодПоставки") FROM "Поставка";
13:33:18
SELECT SUM("КодПоставщика") FROM "Поставщик";
13:32:54
SELECT SUM("Кол-во") FROM "Товары";
13:32:00
SELECT SUM("Наличие") FROM "Товары";
13:22:43
SELECT SUM("СтоимостьПродажи") FROM "Товары";
13:22:33
SELECT SUM("СтоимостьЗакупки") FROM "Товары";
13:20:55
SELECT * FROM clients_view;
13:10:41
CREATE VIEW clients_view AS SELECT CONCAT(LEFT("ФИО", 2), '***', RIGHT("ФИО", 1)) AS "ФИО", CONCAT(LEFT("Адрес", 5), '***', RIGHT("Адрес", 1)) AS "Адрес", CONCAT(LEFT("Телефон", 5), '***', RIGHT("Телефон", 1)) AS "Телефон" FROM "Клиенты";
13:09:58
CREATE VIEW clients AS SELECT CONCAT(LEFT("ФИО", 2), '***', RIGHT("ФИО", 1)) AS "ФИО", CONCAT(LEFT("Адрес", 5), '***', RIGHT("Адрес", 1)) AS "Адрес", CONCAT(LEFT("Телефон", 5), '***', RIGHT("Телефон", 1)) AS "Телефон" FROM "Клиенты";
13:09:44
CREATE VIEW clients AS SELECT CONCAT(SUBSTRING("ФИО", 1, 2, 3), '***', SUBSTRING("ФИО", -1)) AS "ФИО", CONCAT(SUBSTRING("Адрес", 1, 2, 3, 4, 5), '***', SUBSTRING("Адрес", -1)) AS "Адрес", CONCAT(SUBSTRING("Телефон", 1, 2, 3, 4, 5), '***', SUBSTRING("Телефон", -1)) AS "Телефон" FROM "Клиенты";
13:04:53
CREATE VIEW clients AS SELECT CONCAT(SUBSTRING("ФИО", 1, 2, 3), '***', SUBSTR("ФИО", -1)) AS "ФИО", CONCAT(SUBSTRING("Адрес", 1, 2, 3, 4, 5), '***', SUBSTR("Адрес", -1)) AS "Адрес", CONCAT(SUBSTRING("Телефон", 1, 2, 3, 4, 5), '***', SUBSTR("Телефон", -1)) AS "Телефон" FROM "Клиенты";
13:03:51
CREATE VIEW clients AS SELECT CONCAT(SUBSTR("ФИО", 1, 2, 3), '***', SUBSTR("ФИО", -1)) AS "ФИО", CONCAT(SUBSTR("Адрес", 1, 2, 3, 4, 5), '***', SUBSTR("Адрес", -1)) AS "Адрес", CONCAT(SUBSTR("Телефон", 1, 2, 3, 4, 5), '***', SUBSTR("Телефон", -1)) AS "Телефон" FROM "Клиенты";
13:02:53
CREATE VIEW clients AS SELECT CONCAT(SUBSTR("ФИО", 1, 2, 3), '***', SUBSTR("ФИО", -1) AS "ФИО_скр", CONCAT(SUBSTR("Адрес", 1, 2, 3, 4, 5), '***', SUBSTR("Адрес", -1) AS "Адрес", CONCAT(SUBSTR("Телефон", 1, 2, 3, 4, 5), '***', SUBSTR("Телефон", -1) AS "Телефон" FROM "Клиенты";
13:02:14
CREATE VIEW clients AS SELECT CONCAT(SUBSTR("ФИО", 1, 2, 3), '***', SUBSTR("ФИО", -1) AS "ФИО", CONCAT(SUBSTR("Адрес", 1, 2, 3, 4, 5), '***', SUBSTR("Адрес", -1) AS "Адрес", CONCAT(SUBSTR("Телефон", 1, 2, 3, 4, 5), '***', SUBSTR("Телефон", -1) AS "Телефон" FROM "Клиенты";
13:01:43
CREATE INDEX goods ON "Товары" ("НаименованиеТовара", "ТехническиеХарактеристики", "Описание");
20:47:35
CREATE INDEX employee ON "Сотрудники" ("Фамилия", "Имя", "Должность");
20:46:26
CREATE INDEX supplier ON "Поставщик" ("НазваниеПоставщика", "ПредставительПоставщика", "Обращаться");
20:45:08
CREATE INDEX supply ON "Поставка" ("КодПоставки", "КодПоставщика", "ДатаПоставки");
20:32:26
CREATE INDEX orders ON "Заказы" ("КодТовара", "ДатаРазмещения", "ДатаИсполнения");
20:30:59
CREATE INDEX clients ON "Клиенты" ("ФИО", "Адрес", "Телефон")
19:24:43
SELECT DISTINCT "ДатаПоставки" FROM "Поставка";
19:18:57
SELECT DISTINCT "КодПоставщика" FROM "Поставка";
19:18:42
SELECT DISTINCT "Кол-во" FROM "Товары";
19:18:09
SELECT DISTINCT "КодПоставки" FROM "Товары";
19:17:47
SELECT DISTINCT "КодТовара" FROM "Заказы";
19:17:11
SELECT DISTINCT "КодСотрудника" FROM "Заказы";
19:16:53
SELECT DISTINCT "Адрес" FROM "Поставщик";
19:16:23
SELECT DISTINCT "Обращаться" FROM "Поставщик";
19:16:13
SELECT DISTINCT "Должность" FROM "Сотрудники";
19:15:35
SELECT DISTINCT "Должность", "Адрес" FROM "Сотрудники";
19:15:20
SELECT DISTINCT "Имя", "Отчество" FROM "Сотрудники";
19:14:53
SELECT DISTINCT "КодКлиента", "ФИО" FROM "Клиенты";
19:14:23
SELECT DISTINCT "Телефон", "Адрес" FROM "Клиенты";
19:14:01
SELECT "ДатаПоставки" FROM "Поставка" GROUP BY "ДатаПоставки";
19:12:23
SELECT AVG("СтоимостьЗакупки") FROM "Товары";

